adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 0 : New keys (and IV) ready to be used, reset keybytes, ivbytes */
#define AESL2_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Pos (0UL) /*!< Position of TASKS_INITIALIZE_AES field. */
#define AESL2_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Msk (0x1UL << AESL2_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Pos) /*!< Bit mask of TASKS_INITIALIZE_AES field. */
#define AESL2_TASKS_INITIALIZE_AES_TASKS_INITIALIZE_AES_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TASKS_START_OPERATION */
/* Description: Start cipher / MAC calculation depending on MODE */

/* Bit 0 : Start cipher / MAC calculation depending on MODE */
#define AESL2_TASKS_START_OPERATION_TASKS_START_OPERATION_Pos (0UL) /*!< Position of TASKS_START_OPERATION field. */
#define AESL2_TASKS_START_OPERATION_TASKS_START_OPERATION_Msk (0x1UL << AESL2_TASKS_START_OPERATION_TASKS_START_OPERATION_Pos) /*!< Bit mask of TASKS_START_OPERATION field. */
#define AESL2_TASKS_START_OPERATION_TASKS_START_OPERATION_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TASKS_FINALIZE_MAC */
/* Description: Finalize MAC calculation */

/* Bit 0 : Finalize MAC calculation */
#define AESL2_TASKS_FINALIZE_MAC_TASKS_FINALIZE_MAC_Pos (0UL) /*!< Position of TASKS_FINALIZE_MAC field. */
#define AESL2_TASKS_FINALIZE_MAC_TASKS_FINALIZE_MAC_Msk (0x1UL << AESL2_TASKS_FINALIZE_MAC_TASKS_FINALIZE_MAC_Pos) /*!< Bit mask of TASKS_FINALIZE_MAC field. */
#define AESL2_TASKS_FINALIZE_MAC_TASKS_FINALIZE_MAC_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_TASKS_RESET */
/* Description: Stop all transfers and crypto operations (initialize) */

/* Bit 0 : Stop all transfers and crypto operations (initialize) */
#define AESL2_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field. */
#define AESL2_TASKS_RESET_TASKS_RESET_Msk (0x1UL << AESL2_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field. */
#define AESL2_TASKS_RESET_TASKS_RESET_Trigger (1UL) /*!< Trigger task */

/* Register: AESL2_EVENTS_GATHER_STARTED */
/* Description: Input DMA started */

/* Bit 0 : Input DMA started */
#define AESL2_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos (0UL) /*!< Position of EVENTS_GATHER_STARTED field. */
#define AESL2_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Msk (0x1UL << AESL2_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos) /*!< Bit mask of EVENTS_GATHER_STARTED field. */
#define AESL2_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_GATHER_DONE */
/* Description: Input DMA done */

/* Bit 0 : Input DMA done */
#define AESL2_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos (0UL) /*!< Position of EVENTS_GATHER_DONE field. */
#define AESL2_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Msk (0x1UL << AESL2_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos) /*!< Bit mask of EVENTS_GATHER_DONE field. */
#define AESL2_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_SCATTER_STARTED */
/* Description: Output DMA started */

/* Bit 0 : Output DMA started */
#define AESL2_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Pos (0UL) /*!< Position of EVENTS_SCATTER_STARTED field. */
#define AESL2_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Msk (0x1UL << AESL2_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Pos) /*!< Bit mask of EVENTS_SCATTER_STARTED field. */
#define AESL2_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_SCATTER_DONE */
/* Description: Output DMA done */

/* Bit 0 : Output DMA done */
#define AESL2_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Pos (0UL) /*!< Position of EVENTS_SCATTER_DONE field. */
#define AESL2_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Msk (0x1UL << AESL2_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Pos) /*!< Bit mask of EVENTS_SCATTER_DONE field. */
#define AESL2_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_IV_READY */
/* Description: IV received (ivbytes == 16) */

/* Bit 0 : IV received (ivbytes == 16) */
#define AESL2_EVENTS_IV_READY_EVENTS_IV_READY_Pos (0UL) /*!< Position of EVENTS_IV_READY field. */
#define AESL2_EVENTS_IV_READY_EVENTS_IV_READY_Msk (0x1UL << AESL2_EVENTS_IV_READY_EVENTS_IV_READY_Pos) /*!< Bit mask of EVENTS_IV_READY field. */
#define AESL2_EVENTS_IV_READY_EVENTS_IV_READY_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_IV_READY_EVENTS_IV_READY_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_AES_INITIALIZED */
/* Description: New keys and IV taken into use */

/* Bit 0 : New keys and IV taken into use */
#define AESL2_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Pos (0UL) /*!< Position of EVENTS_AES_INITIALIZED field. */
#define AESL2_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Msk (0x1UL << AESL2_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Pos) /*!< Bit mask of EVENTS_AES_INITIALIZED field. */
#define AESL2_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Generated (1UL) /*!< Event generated */

/* Register: AESL2_EVENTS_MESSAGE_READY */
/* Description: LENGTH == 0 */

/* Bit 0 : LENGTH == 0 */
#define AESL2_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Pos (0UL) /*!< Position of EVENTS_MESSAGE_READY field. */
#define AESL2_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Msk (0x1UL << AESL2_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Pos) /*!< Bit mask of EVENTS_MESSAGE_READY field. */
#define AESL2_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_NotGenerated (0UL) /*!< Event not generated */
#define AESL2_EVENTS_MESSAGE_READY_EVENTS_MESSAGE_READY_Generated (1UL) /*!< Event generated */

