adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Register: CLOCK_HFCLKSTAT */
/* Description: Which HFCLK source is running */

/* Bit 16 : HFCLK state */
#define CLOCK_HFCLKSTAT_STATE_Pos (16UL) /*!< Position of STATE field. */
#define CLOCK_HFCLKSTAT_STATE_Msk (0x1UL << CLOCK_HFCLKSTAT_STATE_Pos) /*!< Bit mask of STATE field. */
#define CLOCK_HFCLKSTAT_STATE_NotRunning (0UL) /*!< HFCLK not running */
#define CLOCK_HFCLKSTAT_STATE_Running (1UL) /*!< HFCLK running */

/* Bit 0 : Active clock source */
#define CLOCK_HFCLKSTAT_SRC_Pos (0UL) /*!< Position of SRC field. */
#define CLOCK_HFCLKSTAT_SRC_Msk (0x1UL << CLOCK_HFCLKSTAT_SRC_Pos) /*!< Bit mask of SRC field. */
#define CLOCK_HFCLKSTAT_SRC_HFINT (0UL) /*!< HFCLK clock source: HFINT - 64 MHz on-chip oscillator */
#define CLOCK_HFCLKSTAT_SRC_HFXO (1UL) /*!< HFCLK clock source: HFXO - 64 MHz clock derived from external 32 MHz crystal oscillator */

/* Register: CLOCK_LFCLKRUN */
/* Description: Status indicating that LFCLKSTART task has been triggered */

/* Bit 0 : LFCLKSTART task triggered or not */
#define CLOCK_LFCLKRUN_STATUS_Pos (0UL) /*!< Position of STATUS field. */
#define CLOCK_LFCLKRUN_STATUS_Msk (0x1UL << CLOCK_LFCLKRUN_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define CLOCK_LFCLKRUN_STATUS_NotTriggered (0UL) /*!< Task not triggered */
#define CLOCK_LFCLKRUN_STATUS_Triggered (1UL) /*!< Task triggered */

/* Register: CLOCK_LFCLKSTAT */
/* Description: Which LFCLK source is running */

/* Bit 16 : LFCLK state */
#define CLOCK_LFCLKSTAT_STATE_Pos (16UL) /*!< Position of STATE field. */
#define CLOCK_LFCLKSTAT_STATE_Msk (0x1UL << CLOCK_LFCLKSTAT_STATE_Pos) /*!< Bit mask of STATE field. */
#define CLOCK_LFCLKSTAT_STATE_NotRunning (0UL) /*!< LFCLK not running */
#define CLOCK_LFCLKSTAT_STATE_Running (1UL) /*!< LFCLK running */

/* Bits 1..0 : Active clock source */
#define CLOCK_LFCLKSTAT_SRC_Pos (0UL) /*!< Position of SRC field. */
#define CLOCK_LFCLKSTAT_SRC_Msk (0x3UL << CLOCK_LFCLKSTAT_SRC_Pos) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSTAT_SRC_NOTUSED (0UL) /*!< Reserved, not used. Will default to 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSTAT_SRC_LFRC (1UL) /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSTAT_SRC_LFXO (2UL) /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSTAT_SRC_LFSYNT (3UL) /*!< 32.768 kHz synthesized from HFCLK */

/* Register: CLOCK_LFCLKSRCCOPY */
/* Description: Copy of LFCLKSRC register, set when LFCLKSTART task was triggered LFULP is not treat as a separate clock source on Alta MLM1, where default clock source (0) is LFRC. */

/* Bits 1..0 : Clock source */
#define CLOCK_LFCLKSRCCOPY_SRC_Pos (0UL) /*!< Position of SRC field. */
#define CLOCK_LFCLKSRCCOPY_SRC_Msk (0x3UL << CLOCK_LFCLKSRCCOPY_SRC_Pos) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSRCCOPY_SRC_NOTUSED (0UL) /*!< Reserved, not used. Will default to 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSRCCOPY_SRC_LFRC (1UL) /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSRCCOPY_SRC_LFXO (2UL) /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSRCCOPY_SRC_LFSYNT (3UL) /*!< 32.768 kHz synthesized from HFCLK */

/* Register: CLOCK_HFCLKSRC */
/* Description: Clock source for the HFCLK oscillator, and configuration of XTAL oscillator. This register shall only be written while no oscillation is present on XC1. Failing to do so may cause unexpected behaviour. */

/* Bit 0 : Select which HFCLK source is started by the START task */
#define CLOCK_HFCLKSRC_SRC_Pos (0UL) /*!< Position of SRC field. */
#define CLOCK_HFCLKSRC_SRC_Msk (0x1UL << CLOCK_HFCLKSRC_SRC_Pos) /*!< Bit mask of SRC field. */
#define CLOCK_HFCLKSRC_SRC_HFINT (0UL) /*!< HFCLKSTART task starts HFINT oscillator */
#define CLOCK_HFCLKSRC_SRC_HFXO (1UL) /*!< HFCLKSTART task starts HFXO oscillator */

/* Register: CLOCK_LFCLKSRC */
/* Description: Clock source for the LFCLK. LFCLKSTART task starts starts a clock source selected with this register. LFULP is not treat as a separate clock source on Alta MLM1, where default clock source (0) is LFRC. */

/* Bits 1..0 : Clock source */
#define CLOCK_LFCLKSRC_SRC_Pos (0UL) /*!< Position of SRC field. */
#define CLOCK_LFCLKSRC_SRC_Msk (0x3UL << CLOCK_LFCLKSRC_SRC_Pos) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSRC_SRC_NOTUSED (0UL) /*!< Reserved, not used. Will default to 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSRC_SRC_LFRC (1UL) /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSRC_SRC_LFXO (2UL) /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSRC_SRC_LFSYNT (3UL) /*!< 32.768 kHz synthesized from HFCLK */


/* Peripheral: CTRLAPPERI */
/* Description: Control access port */

/* Register: CTRLAPPERI_CTRLDAP2COREDATA */
/* Description: Data sent from the Debugger to the Core */

/* Bits 31..0 : General Data */
#define CTRLAPPERI_CTRLDAP2COREDATA_DATA_Pos (0UL) /*!< Position of DATA field. */
#define CTRLAPPERI_CTRLDAP2COREDATA_DATA_Msk (0xFFFFFFFFUL << CTRLAPPERI_CTRLDAP2COREDATA_DATA_Pos) /*!< Bit mask of DATA field. */

/* Register: CTRLAPPERI_CTRLDAP2CORESTATUS */
/* Description: Status to indicate if Data sent from the Debugger to the Core has been read */

/* Bit 0 : Status of data in CTRLDAP2COREDATA register */
#define CTRLAPPERI_CTRLDAP2CORESTATUS_STATUS_Pos (0UL) /*!< Position of STATUS field. */
#define CTRLAPPERI_CTRLDAP2CORESTATUS_STATUS_Msk (0x1UL << CTRLAPPERI_CTRLDAP2CORESTATUS_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define CTRLAPPERI_CTRLDAP2CORESTATUS_STATUS_NoDataPending (0UL) /*!< No data pending in CTRLDAP2COREDATA */
#define CTRLAPPERI_CTRLDAP2CORESTATUS_STATUS_DataPending (1UL) /*!< Data pending in CTRLDAP2COREDATA */

/* Register: CTRLAPPERI_CORE2CTRLDAPDATA */
/* Description: Data sent from the Core to the Debugger */

/* Bits 31..0 : General Data */
#define CTRLAPPERI_CORE2CTRLDAPDATA_DATA_Pos (0UL) /*!< Position of DATA field. */
#define CTRLAPPERI_CORE2CTRLDAPDATA_DATA_Msk (0xFFFFFFFFUL << CTRLAPPERI_CORE2CTRLDAPDATA_DATA_Pos) /*!< Bit mask of DATA field. */

/* Register: CTRLAPPERI_CORE2CTRLDAPSTATUS */
/* Description: Status to indicate if Data sent from the Core to the Debugger status has been read */

/* Bit 0 : Status of data in CORE2CTRLDAPDATA register */
#define CTRLAPPERI_CORE2CTRLDAPSTATUS_STATUS_Pos (0UL) /*!< Position of STATUS field. */
#define CTRLAPPERI_CORE2CTRLDAPSTATUS_STATUS_Msk (0x1UL << CTRLAPPERI_CORE2CTRLDAPSTATUS_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define CTRLAPPERI_CORE2CTRLDAPSTATUS_STATUS_NoDataPending (0UL) /*!< No data pending in CTRLDAP2COREDATA */
#define CTRLAPPERI_CORE2CTRLDAPSTATUS_STATUS_DataPending (1UL) /*!< Data pending in CTRLDAP2COREDATA */

