adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bits 31..22 : TEMP module calibration value (default value for TEMP-&gt;CALIB) */
#define FICR_CHIPCONF02_TEMPCALIB_Pos (22UL) /*!< Position of TEMPCALIB field. */
#define FICR_CHIPCONF02_TEMPCALIB_Msk (0x3FFUL << FICR_CHIPCONF02_TEMPCALIB_Pos) /*!< Bit mask of TEMPCALIB field. */

/* Bits 19..16 : wait-states (excluding the cache controller) for I-Code flash access, D-Code has one more wait-state. */
#define FICR_CHIPCONF02_WS_Pos (16UL) /*!< Position of WS field. */
#define FICR_CHIPCONF02_WS_Msk (0xFUL << FICR_CHIPCONF02_WS_Pos) /*!< Bit mask of WS field. */
#define FICR_CHIPCONF02_WS_1WS (1UL) /*!< 1 wait-state in total for I-Code (2 for D-Code) */
#define FICR_CHIPCONF02_WS_2WS (2UL) /*!< 2 wait-state in total for I-Code (3 for D-Code) */
#define FICR_CHIPCONF02_WS_3WS (3UL) /*!< 3 wait-state in total for I-Code (4 for D-Code) */
#define FICR_CHIPCONF02_WS_4WS (4UL) /*!< 4 wait-state in total for I-Code (5 for D-Code) */
#define FICR_CHIPCONF02_WS_5WS (5UL) /*!< 5 wait-state in total for I-Code (6 for D-Code) */
#define FICR_CHIPCONF02_WS_6WS (6UL) /*!< 6 wait-state in total for I-Code (7 for D-Code) */
#define FICR_CHIPCONF02_WS_7WS (7UL) /*!< 7 wait-state in total for I-Code (8 for D-Code) */
#define FICR_CHIPCONF02_WS_8WS (8UL) /*!< 8 wait-state in total for I-Code (9 for D-Code) */
#define FICR_CHIPCONF02_WS_9WS (9UL) /*!< 9 wait-state in total for I-Code (10 for D-Code) */
#define FICR_CHIPCONF02_WS_10WS (10UL) /*!< 10 wait-state in total for I-Code (11 for D-Code) */
#define FICR_CHIPCONF02_WS_11WS (11UL) /*!< 11 wait-state in total for I-Code (12 for D-Code) */
#define FICR_CHIPCONF02_WS_12WS (12UL) /*!< 12 wait-state in total for I-Code (13 for D-Code) */
#define FICR_CHIPCONF02_WS_13WS (13UL) /*!< 13 wait-state in total for I-Code (14 for D-Code) */
#define FICR_CHIPCONF02_WS_14WS (14UL) /*!< 14 wait-state in total for I-Code (15 for D-Code) */
#define FICR_CHIPCONF02_WS_15WS (15UL) /*!< 15 wait-state in total for I-Code (16 for D-Code) */

/* Bits 15..11 : number of cycles before Information Configuration Registers can be read */
#define FICR_CHIPCONF02_IFCREADDELAY_Pos (11UL) /*!< Position of IFCREADDELAY field. */
#define FICR_CHIPCONF02_IFCREADDELAY_Msk (0x1FUL << FICR_CHIPCONF02_IFCREADDELAY_Pos) /*!< Bit mask of IFCREADDELAY field. */

/* Bits 7..0 : Number of successful FLASHPWRUPn read cycles when powering up flash. After chip power up, the NVMC controller reads FLASHPWRUPn for 7 us. */
#define FICR_CHIPCONF02_FLASHPWRUPCNT_Pos (0UL) /*!< Position of FLASHPWRUPCNT field. */
#define FICR_CHIPCONF02_FLASHPWRUPCNT_Msk (0xFFUL << FICR_CHIPCONF02_FLASHPWRUPCNT_Pos) /*!< Bit mask of FLASHPWRUPCNT field. */

/* Register: FICR_CHIPCONF03 */
/* Description: Miscellaneous modem HW configuration. */

/* Bits 3..0 : Modem M4 RAM wait state configuration, into a modem secure control register. */
#define FICR_CHIPCONF03_RAMWAITSTATE_Pos (0UL) /*!< Position of RAMWAITSTATE field. */
#define FICR_CHIPCONF03_RAMWAITSTATE_Msk (0xFUL << FICR_CHIPCONF03_RAMWAITSTATE_Pos) /*!< Bit mask of RAMWAITSTATE field. */

/* Register: FICR_CHIPCONF04 */
/* Description: MODEM M4 VMC SRAMTRIM values */

/* Bit 6 : Read/Write Margin Adjustment */
#define FICR_CHIPCONF04_RWM_Pos (6UL) /*!< Position of RWM field. */
#define FICR_CHIPCONF04_RWM_Msk (0x1UL << FICR_CHIPCONF04_RWM_Pos) /*!< Bit mask of RWM field. */
#define FICR_CHIPCONF04_RWM_Disabled (0UL) /*!< Disable */
#define FICR_CHIPCONF04_RWM_Enabled (1UL) /*!< Enable */

/* Bit 5 : Read Margin Adjustment */
#define FICR_CHIPCONF04_RM_Pos (5UL) /*!< Position of RM field. */
#define FICR_CHIPCONF04_RM_Msk (0x1UL << FICR_CHIPCONF04_RM_Pos) /*!< Bit mask of RM field. */
#define FICR_CHIPCONF04_RM_Disabled (0UL) /*!< Disable */
#define FICR_CHIPCONF04_RM_Enabled (1UL) /*!< Enable */

/* Bit 4 : Write Margin Adjustment */
#define FICR_CHIPCONF04_WM_Pos (4UL) /*!< Position of WM field. */
#define FICR_CHIPCONF04_WM_Msk (0x1UL << FICR_CHIPCONF04_WM_Pos) /*!< Bit mask of WM field. */
#define FICR_CHIPCONF04_WM_Disabled (0UL) /*!< Disable */
#define FICR_CHIPCONF04_WM_Enabled (1UL) /*!< Enable */

/* Bits 3..0 : Source Bias Trim Adjustment for retention */
#define FICR_CHIPCONF04_BTRIM_Pos (0UL) /*!< Position of BTRIM field. */
#define FICR_CHIPCONF04_BTRIM_Msk (0xFUL << FICR_CHIPCONF04_BTRIM_Pos) /*!< Bit mask of BTRIM field. */

/* Register: FICR_CHIPCONF05 */
/* Description: MODEM M4 VMC RamSSNonRetTSel timing control values for TSMC RAMs */

/* Bits 4..2 : Write cycle timing selection */
#define FICR_CHIPCONF05_WTSEL_Pos (2UL) /*!< Position of WTSEL field. */
#define FICR_CHIPCONF05_WTSEL_Msk (0x7UL << FICR_CHIPCONF05_WTSEL_Pos) /*!< Bit mask of WTSEL field. */

/* Bits 1..0 : Read cycle timing selection */
#define FICR_CHIPCONF05_RTSEL_Pos (0UL) /*!< Position of RTSEL field. */
#define FICR_CHIPCONF05_RTSEL_Msk (0x3UL << FICR_CHIPCONF05_RTSEL_Pos) /*!< Bit mask of RTSEL field. */

/* Register: FICR_CHIPCONF06 */
/* Description: MODEM DSP SRAMTRIM values */

/* Bit 6 : Read/Write Margin Adjustment */
#define FICR_CHIPCONF06_RWM_Pos (6UL) /*!< Position of RWM field. */
#define FICR_CHIPCONF06_RWM_Msk (0x1UL << FICR_CHIPCONF06_RWM_Pos) /*!< Bit mask of RWM field. */
#define FICR_CHIPCONF06_RWM_Disabled (0UL) /*!< Disable */
#define FICR_CHIPCONF06_RWM_Enabled (1UL) /*!< Enable */

/* Bit 5 : Read Margin Adjustment */
#define FICR_CHIPCONF06_RM_Pos (5UL) /*!< Position of RM field. */
#define FICR_CHIPCONF06_RM_Msk (0x1UL << FICR_CHIPCONF06_RM_Pos) /*!< Bit mask of RM field. */
#define FICR_CHIPCONF06_RM_Disabled (0UL) /*!< Disable */
#define FICR_CHIPCONF06_RM_Enabled (1UL) /*!< Enable */

/* Bit 4 : Write Margin Adjustment */
#define FICR_CHIPCONF06_WM_Pos (4UL) /*!< Position of WM field. */
#define FICR_CHIPCONF06_WM_Msk (0x1UL << FICR_CHIPCONF06_WM_Pos) /*!< Bit mask of WM field. */
#define FICR_CHIPCONF06_WM_Disabled (0UL) /*!< Disable */
#define FICR_CHIPCONF06_WM_Enabled (1UL) /*!< Enable */

/* Bits 3..0 : Source Bias Trim Adjustment for retention */
#define FICR_CHIPCONF06_BTRIM_Pos (0UL) /*!< Position of BTRIM field. */
#define FICR_CHIPCONF06_BTRIM_Msk (0xFUL << FICR_CHIPCONF06_BTRIM_Pos) /*!< Bit mask of BTRIM field. */

