adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 6 : Read pending status of interrupt for event RECEIVE[6] */
#define IPC_INTPEND1_RECEIVE6_Pos (6UL) /*!< Position of RECEIVE6 field. */
#define IPC_INTPEND1_RECEIVE6_Msk (0x1UL << IPC_INTPEND1_RECEIVE6_Pos) /*!< Bit mask of RECEIVE6 field. */
#define IPC_INTPEND1_RECEIVE6_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE6_Pending (1UL) /*!< Read: Pending */

/* Bit 5 : Read pending status of interrupt for event RECEIVE[5] */
#define IPC_INTPEND1_RECEIVE5_Pos (5UL) /*!< Position of RECEIVE5 field. */
#define IPC_INTPEND1_RECEIVE5_Msk (0x1UL << IPC_INTPEND1_RECEIVE5_Pos) /*!< Bit mask of RECEIVE5 field. */
#define IPC_INTPEND1_RECEIVE5_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE5_Pending (1UL) /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event RECEIVE[4] */
#define IPC_INTPEND1_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTPEND1_RECEIVE4_Msk (0x1UL << IPC_INTPEND1_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTPEND1_RECEIVE4_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE4_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event RECEIVE[3] */
#define IPC_INTPEND1_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTPEND1_RECEIVE3_Msk (0x1UL << IPC_INTPEND1_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTPEND1_RECEIVE3_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE3_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event RECEIVE[2] */
#define IPC_INTPEND1_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTPEND1_RECEIVE2_Msk (0x1UL << IPC_INTPEND1_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTPEND1_RECEIVE2_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE2_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event RECEIVE[1] */
#define IPC_INTPEND1_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTPEND1_RECEIVE1_Msk (0x1UL << IPC_INTPEND1_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTPEND1_RECEIVE1_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE1_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event RECEIVE[0] */
#define IPC_INTPEND1_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTPEND1_RECEIVE0_Msk (0x1UL << IPC_INTPEND1_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTPEND1_RECEIVE0_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND1_RECEIVE0_Pending (1UL) /*!< Read: Pending */

/* Register: IPC_INTEN2 */
/* Description: Enable or disable interrupt */

/* Bit 7 : Enable or disable interrupt for event RECEIVE[7] */
#define IPC_INTEN2_RECEIVE7_Pos (7UL) /*!< Position of RECEIVE7 field. */
#define IPC_INTEN2_RECEIVE7_Msk (0x1UL << IPC_INTEN2_RECEIVE7_Pos) /*!< Bit mask of RECEIVE7 field. */
#define IPC_INTEN2_RECEIVE7_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE7_Enabled (1UL) /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event RECEIVE[6] */
#define IPC_INTEN2_RECEIVE6_Pos (6UL) /*!< Position of RECEIVE6 field. */
#define IPC_INTEN2_RECEIVE6_Msk (0x1UL << IPC_INTEN2_RECEIVE6_Pos) /*!< Bit mask of RECEIVE6 field. */
#define IPC_INTEN2_RECEIVE6_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE6_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event RECEIVE[5] */
#define IPC_INTEN2_RECEIVE5_Pos (5UL) /*!< Position of RECEIVE5 field. */
#define IPC_INTEN2_RECEIVE5_Msk (0x1UL << IPC_INTEN2_RECEIVE5_Pos) /*!< Bit mask of RECEIVE5 field. */
#define IPC_INTEN2_RECEIVE5_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE5_Enabled (1UL) /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event RECEIVE[4] */
#define IPC_INTEN2_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTEN2_RECEIVE4_Msk (0x1UL << IPC_INTEN2_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTEN2_RECEIVE4_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE4_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
#define IPC_INTEN2_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTEN2_RECEIVE3_Msk (0x1UL << IPC_INTEN2_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTEN2_RECEIVE3_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE3_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
#define IPC_INTEN2_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTEN2_RECEIVE2_Msk (0x1UL << IPC_INTEN2_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTEN2_RECEIVE2_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE2_Enabled (1UL) /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
#define IPC_INTEN2_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTEN2_RECEIVE1_Msk (0x1UL << IPC_INTEN2_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTEN2_RECEIVE1_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE1_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
#define IPC_INTEN2_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTEN2_RECEIVE0_Msk (0x1UL << IPC_INTEN2_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTEN2_RECEIVE0_Disabled (0UL) /*!< Disable */
#define IPC_INTEN2_RECEIVE0_Enabled (1UL) /*!< Enable */

/* Register: IPC_INTENSET2 */
/* Description: Enable interrupt */

/* Bit 7 : Write '1' to enable interrupt for event RECEIVE[7] */
#define IPC_INTENSET2_RECEIVE7_Pos (7UL) /*!< Position of RECEIVE7 field. */
#define IPC_INTENSET2_RECEIVE7_Msk (0x1UL << IPC_INTENSET2_RECEIVE7_Pos) /*!< Bit mask of RECEIVE7 field. */
#define IPC_INTENSET2_RECEIVE7_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE7_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE7_Set (1UL) /*!< Enable */

