adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 6 : Write '1' to enable interrupt for event RECEIVE[6] */
#define IPC_INTENSET2_RECEIVE6_Pos (6UL) /*!< Position of RECEIVE6 field. */
#define IPC_INTENSET2_RECEIVE6_Msk (0x1UL << IPC_INTENSET2_RECEIVE6_Pos) /*!< Bit mask of RECEIVE6 field. */
#define IPC_INTENSET2_RECEIVE6_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE6_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE6_Set (1UL) /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event RECEIVE[5] */
#define IPC_INTENSET2_RECEIVE5_Pos (5UL) /*!< Position of RECEIVE5 field. */
#define IPC_INTENSET2_RECEIVE5_Msk (0x1UL << IPC_INTENSET2_RECEIVE5_Pos) /*!< Bit mask of RECEIVE5 field. */
#define IPC_INTENSET2_RECEIVE5_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE5_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE5_Set (1UL) /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event RECEIVE[4] */
#define IPC_INTENSET2_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTENSET2_RECEIVE4_Msk (0x1UL << IPC_INTENSET2_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTENSET2_RECEIVE4_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE4_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE4_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event RECEIVE[3] */
#define IPC_INTENSET2_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTENSET2_RECEIVE3_Msk (0x1UL << IPC_INTENSET2_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTENSET2_RECEIVE3_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE3_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE3_Set (1UL) /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event RECEIVE[2] */
#define IPC_INTENSET2_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTENSET2_RECEIVE2_Msk (0x1UL << IPC_INTENSET2_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTENSET2_RECEIVE2_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE2_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE2_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event RECEIVE[1] */
#define IPC_INTENSET2_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTENSET2_RECEIVE1_Msk (0x1UL << IPC_INTENSET2_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTENSET2_RECEIVE1_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE1_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE1_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event RECEIVE[0] */
#define IPC_INTENSET2_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTENSET2_RECEIVE0_Msk (0x1UL << IPC_INTENSET2_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTENSET2_RECEIVE0_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENSET2_RECEIVE0_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENSET2_RECEIVE0_Set (1UL) /*!< Enable */

/* Register: IPC_INTENCLR2 */
/* Description: Disable interrupt */

/* Bit 7 : Write '1' to disable interrupt for event RECEIVE[7] */
#define IPC_INTENCLR2_RECEIVE7_Pos (7UL) /*!< Position of RECEIVE7 field. */
#define IPC_INTENCLR2_RECEIVE7_Msk (0x1UL << IPC_INTENCLR2_RECEIVE7_Pos) /*!< Bit mask of RECEIVE7 field. */
#define IPC_INTENCLR2_RECEIVE7_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE7_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE7_Clear (1UL) /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event RECEIVE[6] */
#define IPC_INTENCLR2_RECEIVE6_Pos (6UL) /*!< Position of RECEIVE6 field. */
#define IPC_INTENCLR2_RECEIVE6_Msk (0x1UL << IPC_INTENCLR2_RECEIVE6_Pos) /*!< Bit mask of RECEIVE6 field. */
#define IPC_INTENCLR2_RECEIVE6_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE6_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE6_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event RECEIVE[5] */
#define IPC_INTENCLR2_RECEIVE5_Pos (5UL) /*!< Position of RECEIVE5 field. */
#define IPC_INTENCLR2_RECEIVE5_Msk (0x1UL << IPC_INTENCLR2_RECEIVE5_Pos) /*!< Bit mask of RECEIVE5 field. */
#define IPC_INTENCLR2_RECEIVE5_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE5_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE5_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event RECEIVE[4] */
#define IPC_INTENCLR2_RECEIVE4_Pos (4UL) /*!< Position of RECEIVE4 field. */
#define IPC_INTENCLR2_RECEIVE4_Msk (0x1UL << IPC_INTENCLR2_RECEIVE4_Pos) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTENCLR2_RECEIVE4_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE4_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE4_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event RECEIVE[3] */
#define IPC_INTENCLR2_RECEIVE3_Pos (3UL) /*!< Position of RECEIVE3 field. */
#define IPC_INTENCLR2_RECEIVE3_Msk (0x1UL << IPC_INTENCLR2_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTENCLR2_RECEIVE3_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE3_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE3_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event RECEIVE[2] */
#define IPC_INTENCLR2_RECEIVE2_Pos (2UL) /*!< Position of RECEIVE2 field. */
#define IPC_INTENCLR2_RECEIVE2_Msk (0x1UL << IPC_INTENCLR2_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTENCLR2_RECEIVE2_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE2_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE2_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event RECEIVE[1] */
#define IPC_INTENCLR2_RECEIVE1_Pos (1UL) /*!< Position of RECEIVE1 field. */
#define IPC_INTENCLR2_RECEIVE1_Msk (0x1UL << IPC_INTENCLR2_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTENCLR2_RECEIVE1_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE1_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE1_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event RECEIVE[0] */
#define IPC_INTENCLR2_RECEIVE0_Pos (0UL) /*!< Position of RECEIVE0 field. */
#define IPC_INTENCLR2_RECEIVE0_Msk (0x1UL << IPC_INTENCLR2_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTENCLR2_RECEIVE0_Disabled (0UL) /*!< Read: Disabled */
#define IPC_INTENCLR2_RECEIVE0_Enabled (1UL) /*!< Read: Enabled */
#define IPC_INTENCLR2_RECEIVE0_Clear (1UL) /*!< Disable */

/* Register: IPC_INTPEND2 */
/* Description: Pending interrupts */

/* Bit 7 : Read pending status of interrupt for event RECEIVE[7] */
#define IPC_INTPEND2_RECEIVE7_Pos (7UL) /*!< Position of RECEIVE7 field. */
#define IPC_INTPEND2_RECEIVE7_Msk (0x1UL << IPC_INTPEND2_RECEIVE7_Pos) /*!< Bit mask of RECEIVE7 field. */
#define IPC_INTPEND2_RECEIVE7_NotPending (0UL) /*!< Read: Not pending */
#define IPC_INTPEND2_RECEIVE7_Pending (1UL) /*!< Read: Pending */

