adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 1 : Write '1' to disable interrupt for event KEYSLOT_REVOKED */
#define KMU_INTENCLR_KEYSLOT_REVOKED_Pos (1UL) /*!< Position of KEYSLOT_REVOKED field. */
#define KMU_INTENCLR_KEYSLOT_REVOKED_Msk (0x1UL << KMU_INTENCLR_KEYSLOT_REVOKED_Pos) /*!< Bit mask of KEYSLOT_REVOKED field. */
#define KMU_INTENCLR_KEYSLOT_REVOKED_Disabled (0UL) /*!< Read: Disabled */
#define KMU_INTENCLR_KEYSLOT_REVOKED_Enabled (1UL) /*!< Read: Enabled */
#define KMU_INTENCLR_KEYSLOT_REVOKED_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event KEYSLOT_PUSHED */
#define KMU_INTENCLR_KEYSLOT_PUSHED_Pos (0UL) /*!< Position of KEYSLOT_PUSHED field. */
#define KMU_INTENCLR_KEYSLOT_PUSHED_Msk (0x1UL << KMU_INTENCLR_KEYSLOT_PUSHED_Pos) /*!< Bit mask of KEYSLOT_PUSHED field. */
#define KMU_INTENCLR_KEYSLOT_PUSHED_Disabled (0UL) /*!< Read: Disabled */
#define KMU_INTENCLR_KEYSLOT_PUSHED_Enabled (1UL) /*!< Read: Enabled */
#define KMU_INTENCLR_KEYSLOT_PUSHED_Clear (1UL) /*!< Disable */

/* Register: KMU_INTPEND */
/* Description: Pending interrupts */

/* Bit 2 : Read pending status of interrupt for event KEYSLOT_ERROR */
#define KMU_INTPEND_KEYSLOT_ERROR_Pos (2UL) /*!< Position of KEYSLOT_ERROR field. */
#define KMU_INTPEND_KEYSLOT_ERROR_Msk (0x1UL << KMU_INTPEND_KEYSLOT_ERROR_Pos) /*!< Bit mask of KEYSLOT_ERROR field. */
#define KMU_INTPEND_KEYSLOT_ERROR_NotPending (0UL) /*!< Read: Not pending */
#define KMU_INTPEND_KEYSLOT_ERROR_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event KEYSLOT_REVOKED */
#define KMU_INTPEND_KEYSLOT_REVOKED_Pos (1UL) /*!< Position of KEYSLOT_REVOKED field. */
#define KMU_INTPEND_KEYSLOT_REVOKED_Msk (0x1UL << KMU_INTPEND_KEYSLOT_REVOKED_Pos) /*!< Bit mask of KEYSLOT_REVOKED field. */
#define KMU_INTPEND_KEYSLOT_REVOKED_NotPending (0UL) /*!< Read: Not pending */
#define KMU_INTPEND_KEYSLOT_REVOKED_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event KEYSLOT_PUSHED */
#define KMU_INTPEND_KEYSLOT_PUSHED_Pos (0UL) /*!< Position of KEYSLOT_PUSHED field. */
#define KMU_INTPEND_KEYSLOT_PUSHED_Msk (0x1UL << KMU_INTPEND_KEYSLOT_PUSHED_Pos) /*!< Bit mask of KEYSLOT_PUSHED field. */
#define KMU_INTPEND_KEYSLOT_PUSHED_NotPending (0UL) /*!< Read: Not pending */
#define KMU_INTPEND_KEYSLOT_PUSHED_Pending (1UL) /*!< Read: Pending */

/* Register: KMU_STATUS */
/* Description: Status bits for KMU operation. */

/* Bit 1 : Violation status */
#define KMU_STATUS_BLOCKED_Pos (1UL) /*!< Position of BLOCKED field. */
#define KMU_STATUS_BLOCKED_Msk (0x1UL << KMU_STATUS_BLOCKED_Pos) /*!< Bit mask of BLOCKED field. */
#define KMU_STATUS_BLOCKED_Disabled (0UL) /*!< No access violation detected. */
#define KMU_STATUS_BLOCKED_Enabled (1UL) /*!< Access violation detected and blocked. */

/* Bit 0 : Key slot ID successfully selected by the KMU. */
#define KMU_STATUS_SELECTED_Pos (0UL) /*!< Position of SELECTED field. */
#define KMU_STATUS_SELECTED_Msk (0x1UL << KMU_STATUS_SELECTED_Pos) /*!< Bit mask of SELECTED field. */
#define KMU_STATUS_SELECTED_Disabled (0UL) /*!< No key slot ID selected by KMU */
#define KMU_STATUS_SELECTED_Enabled (1UL) /*!< Key slot ID successfully selected by KMU */

/* Register: KMU_SELECTKEYSLOT */
/* Description: Select key slot ID to be read over AHB or pushed over secure APB when TASKS_PUSH_KEYSLOT is started. */

/* Bits 7..0 : Select key slot ID to be read over AHB or pushed over secure APB when TASKS_PUSH_KEYSLOT is started. */
#define KMU_SELECTKEYSLOT_ID_Pos (0UL) /*!< Position of ID field. */
#define KMU_SELECTKEYSLOT_ID_Msk (0xFFUL << KMU_SELECTKEYSLOT_ID_Pos) /*!< Bit mask of ID field. */


/* Peripheral: LFCLKCALIBMEAS */
/* Description: LfClk Calibration Measurement */

/* Register: LFCLKCALIBMEAS_TASKS_START */
/* Description: Start Measuring */

/* Bit 0 : Start Measuring */
#define LFCLKCALIBMEAS_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define LFCLKCALIBMEAS_TASKS_START_TASKS_START_Msk (0x1UL << LFCLKCALIBMEAS_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define LFCLKCALIBMEAS_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: LFCLKCALIBMEAS_TASKS_STOP */
/* Description: Switch LfClkCalibMeas to STOPPED state. Brings LfClkCalibMeas from SHUTDOWN state to a configurable state before a measurement is launched. */

/* Bit 0 : Switch LfClkCalibMeas to STOPPED state. Brings LfClkCalibMeas from SHUTDOWN state to a configurable state before a measurement is launched. */
#define LFCLKCALIBMEAS_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define LFCLKCALIBMEAS_TASKS_STOP_TASKS_STOP_Msk (0x1UL << LFCLKCALIBMEAS_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define LFCLKCALIBMEAS_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: LFCLKCALIBMEAS_TASKS_SHUTDOWN */
/* Description: Shut down LfClkCalibMeas */

/* Bit 0 : Shut down LfClkCalibMeas */
#define LFCLKCALIBMEAS_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos (0UL) /*!< Position of TASKS_SHUTDOWN field. */
#define LFCLKCALIBMEAS_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk (0x1UL << LFCLKCALIBMEAS_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos) /*!< Bit mask of TASKS_SHUTDOWN field. */
#define LFCLKCALIBMEAS_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Trigger (1UL) /*!< Trigger task */

/* Register: LFCLKCALIBMEAS_EVENTS_COMPLETE */
/* Description: Measurement completed. */

/* Bit 0 : Measurement completed. */
#define LFCLKCALIBMEAS_EVENTS_COMPLETE_EVENTS_COMPLETE_Pos (0UL) /*!< Position of EVENTS_COMPLETE field. */
#define LFCLKCALIBMEAS_EVENTS_COMPLETE_EVENTS_COMPLETE_Msk (0x1UL << LFCLKCALIBMEAS_EVENTS_COMPLETE_EVENTS_COMPLETE_Pos) /*!< Bit mask of EVENTS_COMPLETE field. */
#define LFCLKCALIBMEAS_EVENTS_COMPLETE_EVENTS_COMPLETE_NotGenerated (0UL) /*!< Event not generated */
#define LFCLKCALIBMEAS_EVENTS_COMPLETE_EVENTS_COMPLETE_Generated (1UL) /*!< Event generated */

/* Register: LFCLKCALIBMEAS_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 0 : Enable or disable interrupt for event COMPLETE */
#define LFCLKCALIBMEAS_INTEN_COMPLETE_Pos (0UL) /*!< Position of COMPLETE field. */
#define LFCLKCALIBMEAS_INTEN_COMPLETE_Msk (0x1UL << LFCLKCALIBMEAS_INTEN_COMPLETE_Pos) /*!< Bit mask of COMPLETE field. */
#define LFCLKCALIBMEAS_INTEN_COMPLETE_Disabled (0UL) /*!< Disable */
#define LFCLKCALIBMEAS_INTEN_COMPLETE_Enabled (1UL) /*!< Enable */

/* Register: LFCLKCALIBMEAS_INTENSET */
/* Description: Enable interrupt */

/* Bit 0 : Write '1' to enable interrupt for event COMPLETE */
#define LFCLKCALIBMEAS_INTENSET_COMPLETE_Pos (0UL) /*!< Position of COMPLETE field. */
#define LFCLKCALIBMEAS_INTENSET_COMPLETE_Msk (0x1UL << LFCLKCALIBMEAS_INTENSET_COMPLETE_Pos) /*!< Bit mask of COMPLETE field. */
#define LFCLKCALIBMEAS_INTENSET_COMPLETE_Disabled (0UL) /*!< Read: Disabled */
#define LFCLKCALIBMEAS_INTENSET_COMPLETE_Enabled (1UL) /*!< Read: Enabled */
#define LFCLKCALIBMEAS_INTENSET_COMPLETE_Set (1UL) /*!< Enable */

/* Register: LFCLKCALIBMEAS_INTENCLR */
/* Description: Disable interrupt */

/* Bit 0 : Write '1' to disable interrupt for event COMPLETE */
#define LFCLKCALIBMEAS_INTENCLR_COMPLETE_Pos (0UL) /*!< Position of COMPLETE field. */
#define LFCLKCALIBMEAS_INTENCLR_COMPLETE_Msk (0x1UL << LFCLKCALIBMEAS_INTENCLR_COMPLETE_Pos) /*!< Bit mask of COMPLETE field. */
#define LFCLKCALIBMEAS_INTENCLR_COMPLETE_Disabled (0UL) /*!< Read: Disabled */
#define LFCLKCALIBMEAS_INTENCLR_COMPLETE_Enabled (1UL) /*!< Read: Enabled */
#define LFCLKCALIBMEAS_INTENCLR_COMPLETE_Clear (1UL) /*!< Disable */

/* Register: LFCLKCALIBMEAS_INTPEND */
/* Description: Pending interrupts */

/* Bit 0 : Read pending status of interrupt for event COMPLETE */
#define LFCLKCALIBMEAS_INTPEND_COMPLETE_Pos (0UL) /*!< Position of COMPLETE field. */
#define LFCLKCALIBMEAS_INTPEND_COMPLETE_Msk (0x1UL << LFCLKCALIBMEAS_INTPEND_COMPLETE_Pos) /*!< Bit mask of COMPLETE field. */
#define LFCLKCALIBMEAS_INTPEND_COMPLETE_NotPending (0UL) /*!< Read: Not pending */
#define LFCLKCALIBMEAS_INTPEND_COMPLETE_Pending (1UL) /*!< Read: Pending */

/* Register: LFCLKCALIBMEAS_RUNTIME */
/* Description: Runtime status of the measurement. */

/* Bits 28..8 : lastMeasuredLfCycle */
#define LFCLKCALIBMEAS_RUNTIME_LMLC_Pos (8UL) /*!< Position of LMLC field. */
#define LFCLKCALIBMEAS_RUNTIME_LMLC_Msk (0x1FFFFFUL << LFCLKCALIBMEAS_RUNTIME_LMLC_Pos) /*!< Bit mask of LMLC field. */

