adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bits 3..0 : LastRingBufferIndex */
#define LFCLKCALIBMEAS_RUNTIME_LRBI_Pos (0UL) /*!< Position of LRBI field. */
#define LFCLKCALIBMEAS_RUNTIME_LRBI_Msk (0xFUL << LFCLKCALIBMEAS_RUNTIME_LRBI_Pos) /*!< Bit mask of LRBI field. */

/* Register: LFCLKCALIBMEAS_LCMEAS0 */
/* Description: Results of the measurement. */

/* Bits 31..0 : LfClk Measurement result for the series0. */
#define LFCLKCALIBMEAS_LCMEAS0_LCMEAS_Pos (0UL) /*!< Position of LCMEAS field. */
#define LFCLKCALIBMEAS_LCMEAS0_LCMEAS_Msk (0xFFFFFFFFUL << LFCLKCALIBMEAS_LCMEAS0_LCMEAS_Pos) /*!< Bit mask of LCMEAS field. */

/* Register: LFCLKCALIBMEAS_LCMEAS1 */
/* Description: Results of the measurement. */

/* Bits 31..0 : LfClk Measurement result for the series1. */
#define LFCLKCALIBMEAS_LCMEAS1_LCMEAS_Pos (0UL) /*!< Position of LCMEAS field. */
#define LFCLKCALIBMEAS_LCMEAS1_LCMEAS_Msk (0xFFFFFFFFUL << LFCLKCALIBMEAS_LCMEAS1_LCMEAS_Pos) /*!< Bit mask of LCMEAS field. */

/* Register: LFCLKCALIBMEAS_LCMEAS2 */
/* Description: Results of the measurement. */

/* Bits 31..0 : LfClk Measurement results for the series2. */
#define LFCLKCALIBMEAS_LCMEAS2_LCMEAS_Pos (0UL) /*!< Position of LCMEAS field. */
#define LFCLKCALIBMEAS_LCMEAS2_LCMEAS_Msk (0xFFFFFFFFUL << LFCLKCALIBMEAS_LCMEAS2_LCMEAS_Pos) /*!< Bit mask of LCMEAS field. */

/* Register: LFCLKCALIBMEAS_LCMEAS3 */
/* Description: Results of the measurement. */

/* Bits 31..0 : LfClk Measurement results for the series3. */
#define LFCLKCALIBMEAS_LCMEAS3_LCMEAS_Pos (0UL) /*!< Position of LCMEAS field. */
#define LFCLKCALIBMEAS_LCMEAS3_LCMEAS_Msk (0xFFFFFFFFUL << LFCLKCALIBMEAS_LCMEAS3_LCMEAS_Pos) /*!< Bit mask of LCMEAS field. */

/* Register: LFCLKCALIBMEAS_LCMEAS4 */
/* Description: Results of the measurement. */

/* Bits 31..0 : LfClk Measurement results for the series4. */
#define LFCLKCALIBMEAS_LCMEAS4_LCMEAS_Pos (0UL) /*!< Position of LCMEAS field. */
#define LFCLKCALIBMEAS_LCMEAS4_LCMEAS_Msk (0xFFFFFFFFUL << LFCLKCALIBMEAS_LCMEAS4_LCMEAS_Pos) /*!< Bit mask of LCMEAS field. */

/* Register: LFCLKCALIBMEAS_LCMEAS5 */
/* Description: Results of the measurement. */

/* Bits 31..0 : LfClk Measurement results for the series5. Only available, if HW parameter NUM_MEASUREMENTS set to larger than five. */
#define LFCLKCALIBMEAS_LCMEAS5_LCMEAS_Pos (0UL) /*!< Position of LCMEAS field. */
#define LFCLKCALIBMEAS_LCMEAS5_LCMEAS_Msk (0xFFFFFFFFUL << LFCLKCALIBMEAS_LCMEAS5_LCMEAS_Pos) /*!< Bit mask of LCMEAS field. */

/* Register: LFCLKCALIBMEAS_LCMEAS6 */
/* Description: Results of the measurement. */

/* Bits 31..0 : LfClk Measurement results for the series6. Only available, if HW parameter NUM_MEASUREMENTS set to larger than six. */
#define LFCLKCALIBMEAS_LCMEAS6_LCMEAS_Pos (0UL) /*!< Position of LCMEAS field. */
#define LFCLKCALIBMEAS_LCMEAS6_LCMEAS_Msk (0xFFFFFFFFUL << LFCLKCALIBMEAS_LCMEAS6_LCMEAS_Pos) /*!< Bit mask of LCMEAS field. */

/* Register: LFCLKCALIBMEAS_LCMEAS7 */
/* Description: Results of the measurement. */

/* Bits 31..0 : LfClk Measurement results for the series7. Only available, if HW parameter NUM_MEASUREMENTS set to larger than seven. */
#define LFCLKCALIBMEAS_LCMEAS7_LCMEAS_Pos (0UL) /*!< Position of LCMEAS field. */
#define LFCLKCALIBMEAS_LCMEAS7_LCMEAS_Msk (0xFFFFFFFFUL << LFCLKCALIBMEAS_LCMEAS7_LCMEAS_Pos) /*!< Bit mask of LCMEAS field. */

/* Register: LFCLKCALIBMEAS_LCMEAS8 */
/* Description: Results of the measurement. */

/* Bits 31..0 : LfClk Measurement results for the series8. Only available, if HW parameter NUM_MEASUREMENTS set to larger than eight. */
#define LFCLKCALIBMEAS_LCMEAS8_LCMEAS_Pos (0UL) /*!< Position of LCMEAS field. */
#define LFCLKCALIBMEAS_LCMEAS8_LCMEAS_Msk (0xFFFFFFFFUL << LFCLKCALIBMEAS_LCMEAS8_LCMEAS_Pos) /*!< Bit mask of LCMEAS field. */

/* Register: LFCLKCALIBMEAS_LCMEAS9 */
/* Description: Results of the measurement. */

/* Bits 31..0 : LfClk Measurement results for the series9. Only available, if HW parameter NUM_MEASUREMENTS set to larger than nine. */
#define LFCLKCALIBMEAS_LCMEAS9_LCMEAS_Pos (0UL) /*!< Position of LCMEAS field. */
#define LFCLKCALIBMEAS_LCMEAS9_LCMEAS_Msk (0xFFFFFFFFUL << LFCLKCALIBMEAS_LCMEAS9_LCMEAS_Pos) /*!< Bit mask of LCMEAS field. */

/* Register: LFCLKCALIBMEAS_STATE */
/* Description: Current running state of the IP. */

/* Bits 1..0 :   */
#define LFCLKCALIBMEAS_STATE_STATE_Pos (0UL) /*!< Position of STATE field. */
#define LFCLKCALIBMEAS_STATE_STATE_Msk (0x3UL << LFCLKCALIBMEAS_STATE_STATE_Pos) /*!< Bit mask of STATE field. */
#define LFCLKCALIBMEAS_STATE_STATE_SHUTDOWN (0UL) /*!< In SHUTDOWN. */
#define LFCLKCALIBMEAS_STATE_STATE_STOPPED (1UL) /*!< In STOPPED. */
#define LFCLKCALIBMEAS_STATE_STATE_RUNNING (2UL) /*!< In RUNNING. */
#define LFCLKCALIBMEAS_STATE_STATE_NA (3UL) /*!< NA. */

/* Register: LFCLKCALIBMEAS_MEASLEN */
/* Description: Length of the measurement. */

/* Bits 20..0 : Length of the measurement. */
#define LFCLKCALIBMEAS_MEASLEN_MEASLEN_Pos (0UL) /*!< Position of MEASLEN field. */
#define LFCLKCALIBMEAS_MEASLEN_MEASLEN_Msk (0x1FFFFFUL << LFCLKCALIBMEAS_MEASLEN_MEASLEN_Pos) /*!< Bit mask of MEASLEN field. */


/* Peripheral: WDT */
/* Description: Watchdog Timer 0 */

/* Register: WDT_TASKS_START */
/* Description: Start the watchdog */

/* Bit 0 : Start the watchdog */
#define WDT_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define WDT_TASKS_START_TASKS_START_Msk (0x1UL << WDT_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define WDT_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: WDT_TASKS_STOP */
/* Description: Stop the watchdog timer. Only available in timer mode. */

/* Bit 0 : Stop the watchdog timer. Only available in timer mode. */
#define WDT_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define WDT_TASKS_STOP_TASKS_STOP_Msk (0x1UL << WDT_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define WDT_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

