adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 0 : Write '1' to enable interrupt for event END */
#define M2M_INTENSET_END_Pos (0UL) /*!< Position of END field. */
#define M2M_INTENSET_END_Msk (0x1UL << M2M_INTENSET_END_Pos) /*!< Bit mask of END field. */
#define M2M_INTENSET_END_Disabled (0UL) /*!< Read: Disabled */
#define M2M_INTENSET_END_Enabled (1UL) /*!< Read: Enabled */
#define M2M_INTENSET_END_Set (1UL) /*!< Enable */

/* Register: M2M_INTENCLR */
/* Description: Disable interrupt */

/* Bit 1 : Write '1' to disable interrupt for event STARTED */
#define M2M_INTENCLR_STARTED_Pos (1UL) /*!< Position of STARTED field. */
#define M2M_INTENCLR_STARTED_Msk (0x1UL << M2M_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define M2M_INTENCLR_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define M2M_INTENCLR_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define M2M_INTENCLR_STARTED_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event END */
#define M2M_INTENCLR_END_Pos (0UL) /*!< Position of END field. */
#define M2M_INTENCLR_END_Msk (0x1UL << M2M_INTENCLR_END_Pos) /*!< Bit mask of END field. */
#define M2M_INTENCLR_END_Disabled (0UL) /*!< Read: Disabled */
#define M2M_INTENCLR_END_Enabled (1UL) /*!< Read: Enabled */
#define M2M_INTENCLR_END_Clear (1UL) /*!< Disable */

/* Register: M2M_INTPEND */
/* Description: Pending interrupts */

/* Bit 1 : Read pending status of interrupt for event STARTED */
#define M2M_INTPEND_STARTED_Pos (1UL) /*!< Position of STARTED field. */
#define M2M_INTPEND_STARTED_Msk (0x1UL << M2M_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field. */
#define M2M_INTPEND_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define M2M_INTPEND_STARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event END */
#define M2M_INTPEND_END_Pos (0UL) /*!< Position of END field. */
#define M2M_INTPEND_END_Msk (0x1UL << M2M_INTPEND_END_Pos) /*!< Bit mask of END field. */
#define M2M_INTPEND_END_NotPending (0UL) /*!< Read: Not pending */
#define M2M_INTPEND_END_Pending (1UL) /*!< Read: Pending */

/* Register: M2M_IN_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define M2M_IN_PTR_PTR_Pos (0UL) /*!< Position of PTR field. */
#define M2M_IN_PTR_PTR_Msk (0xFFFFFFFFUL << M2M_IN_PTR_PTR_Pos) /*!< Bit mask of PTR field. */

/* Register: M2M_IN_MAXCNT */
/* Description: Maximum number of bytes in input and output buffer */

/* Bits 7..0 : Maximum number of bytes in input and output buffer */
#define M2M_IN_MAXCNT_MAXCNT_Pos (0UL) /*!< Position of MAXCNT field. */
#define M2M_IN_MAXCNT_MAXCNT_Msk (0xFFUL << M2M_IN_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field. */

/* Register: M2M_IN_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 7..0 : Number of bytes transferred in the last transaction */
#define M2M_IN_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define M2M_IN_AMOUNT_AMOUNT_Msk (0xFFUL << M2M_IN_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

/* Register: M2M_IN_LIST */
/* Description: EasyDMA list type */

/* Bits 2..0 : List type */
#define M2M_IN_LIST_LIST_Pos (0UL) /*!< Position of LIST field. */
#define M2M_IN_LIST_LIST_Msk (0x7UL << M2M_IN_LIST_LIST_Pos) /*!< Bit mask of LIST field. */
#define M2M_IN_LIST_LIST_Disabled (0UL) /*!< Disable EasyDMA list */
#define M2M_IN_LIST_LIST_ArrayList (1UL) /*!< Use array list */

/* Register: M2M_OUT_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define M2M_OUT_PTR_PTR_Pos (0UL) /*!< Position of PTR field. */
#define M2M_OUT_PTR_PTR_Msk (0xFFFFFFFFUL << M2M_OUT_PTR_PTR_Pos) /*!< Bit mask of PTR field. */

/* Register: M2M_OUT_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 7..0 : Number of bytes transferred in the last transaction */
#define M2M_OUT_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define M2M_OUT_AMOUNT_AMOUNT_Msk (0xFFUL << M2M_OUT_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

/* Register: M2M_OUT_LIST */
/* Description: EasyDMA list type */

/* Bits 2..0 : List type */
#define M2M_OUT_LIST_LIST_Pos (0UL) /*!< Position of LIST field. */
#define M2M_OUT_LIST_LIST_Msk (0x7UL << M2M_OUT_LIST_LIST_Pos) /*!< Bit mask of LIST field. */
#define M2M_OUT_LIST_LIST_Disabled (0UL) /*!< Disable EasyDMA list */
#define M2M_OUT_LIST_LIST_ArrayList (1UL) /*!< Use array list */


/* Peripheral: MCPLL */
/* Description: Modem Clock PLL */

/* Register: MCPLL_TASKS_START */
/* Description: Start MCPLL */

/* Bit 0 : Start MCPLL */
#define MCPLL_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define MCPLL_TASKS_START_TASKS_START_Msk (0x1UL << MCPLL_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define MCPLL_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: MCPLL_TASKS_UPDATE */
/* Description: Update CONTROL.FRAC and CONTROL.INT values */

/* Bit 0 : Update CONTROL.FRAC and CONTROL.INT values */
#define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Pos (0UL) /*!< Position of TASKS_UPDATE field. */
#define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Msk (0x1UL << MCPLL_TASKS_UPDATE_TASKS_UPDATE_Pos) /*!< Bit mask of TASKS_UPDATE field. */
#define MCPLL_TASKS_UPDATE_TASKS_UPDATE_Trigger (1UL) /*!< Trigger task */

/* Register: MCPLL_TASKS_STOP */
/* Description: Stop MCPLL */

/* Bit 0 : Stop MCPLL */
#define MCPLL_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define MCPLL_TASKS_STOP_TASKS_STOP_Msk (0x1UL << MCPLL_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define MCPLL_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: MCPLL_EVENTS_LOCKERROR */
/* Description: Error event, MCPLL no longer in lock */

/* Bit 0 : Error event, MCPLL no longer in lock */
#define MCPLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Pos (0UL) /*!< Position of EVENTS_LOCKERROR field. */
#define MCPLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Msk (0x1UL << MCPLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Pos) /*!< Bit mask of EVENTS_LOCKERROR field. */
#define MCPLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_NotGenerated (0UL) /*!< Event not generated */
#define MCPLL_EVENTS_LOCKERROR_EVENTS_LOCKERROR_Generated (1UL) /*!< Event generated */

/* Register: MCPLL_INTEN */
/* Description: Enable or disable interrupt */

