adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 0 : Enable or disable interrupt for event LOCKERROR */
#define MCPLL_INTEN_LOCKERROR_Pos (0UL) /*!< Position of LOCKERROR field. */
#define MCPLL_INTEN_LOCKERROR_Msk (0x1UL << MCPLL_INTEN_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define MCPLL_INTEN_LOCKERROR_Disabled (0UL) /*!< Disable */
#define MCPLL_INTEN_LOCKERROR_Enabled (1UL) /*!< Enable */

/* Register: MCPLL_INTENSET */
/* Description: Enable interrupt */

/* Bit 0 : Write '1' to enable interrupt for event LOCKERROR */
#define MCPLL_INTENSET_LOCKERROR_Pos (0UL) /*!< Position of LOCKERROR field. */
#define MCPLL_INTENSET_LOCKERROR_Msk (0x1UL << MCPLL_INTENSET_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define MCPLL_INTENSET_LOCKERROR_Disabled (0UL) /*!< Read: Disabled */
#define MCPLL_INTENSET_LOCKERROR_Enabled (1UL) /*!< Read: Enabled */
#define MCPLL_INTENSET_LOCKERROR_Set (1UL) /*!< Enable */

/* Register: MCPLL_INTENCLR */
/* Description: Disable interrupt */

/* Bit 0 : Write '1' to disable interrupt for event LOCKERROR */
#define MCPLL_INTENCLR_LOCKERROR_Pos (0UL) /*!< Position of LOCKERROR field. */
#define MCPLL_INTENCLR_LOCKERROR_Msk (0x1UL << MCPLL_INTENCLR_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define MCPLL_INTENCLR_LOCKERROR_Disabled (0UL) /*!< Read: Disabled */
#define MCPLL_INTENCLR_LOCKERROR_Enabled (1UL) /*!< Read: Enabled */
#define MCPLL_INTENCLR_LOCKERROR_Clear (1UL) /*!< Disable */

/* Register: MCPLL_INTPEND */
/* Description: Pending interrupts */

/* Bit 0 : Read pending status of interrupt for event LOCKERROR */
#define MCPLL_INTPEND_LOCKERROR_Pos (0UL) /*!< Position of LOCKERROR field. */
#define MCPLL_INTPEND_LOCKERROR_Msk (0x1UL << MCPLL_INTPEND_LOCKERROR_Pos) /*!< Bit mask of LOCKERROR field. */
#define MCPLL_INTPEND_LOCKERROR_NotPending (0UL) /*!< Read: Not pending */
#define MCPLL_INTPEND_LOCKERROR_Pending (1UL) /*!< Read: Pending */

/* Register: MCPLL_INLOCK */
/* Description: MCPLL locked or not */

/* Bit 0 : MCPLL locked or not */
#define MCPLL_INLOCK_INLOCK_Pos (0UL) /*!< Position of INLOCK field. */
#define MCPLL_INLOCK_INLOCK_Msk (0x1UL << MCPLL_INLOCK_INLOCK_Pos) /*!< Bit mask of INLOCK field. */
#define MCPLL_INLOCK_INLOCK_NotInLock (0UL) /*!< MCPLL not locked */
#define MCPLL_INLOCK_INLOCK_InLock (1UL) /*!< MCPLL locked */

/* Register: MCPLL_CONTROL_INT */
/* Description: Integer part of the control word. */

/* Bits 5..0 : Integer part of the control word */
#define MCPLL_CONTROL_INT_INT_Pos (0UL) /*!< Position of INT field. */
#define MCPLL_CONTROL_INT_INT_Msk (0x3FUL << MCPLL_CONTROL_INT_INT_Pos) /*!< Bit mask of INT field. */

/* Register: MCPLL_CONTROL_FRAC */
/* Description: Fractional part of the control word. */

/* Bits 22..0 : Fractional part of the control word */
#define MCPLL_CONTROL_FRAC_FRAC_Pos (0UL) /*!< Position of FRAC field. */
#define MCPLL_CONTROL_FRAC_FRAC_Msk (0x7FFFFFUL << MCPLL_CONTROL_FRAC_FRAC_Pos) /*!< Bit mask of FRAC field. */

/* Register: MCPLL_MA */
/* Description: Post division ratio for OUTA */

/* Bits 2..0 : Post division ratio for OUTA */
#define MCPLL_MA_MA_Pos (0UL) /*!< Position of MA field. */
#define MCPLL_MA_MA_Msk (0x7UL << MCPLL_MA_MA_Pos) /*!< Bit mask of MA field. */
#define MCPLL_MA_MA_BYPASS (0UL) /*!< Bypass */
#define MCPLL_MA_MA_CLK614M4 (1UL) /*!< 614.4 MHz */
#define MCPLL_MA_MA_CLK307M2 (2UL) /*!< 307.2 MHz */
#define MCPLL_MA_MA_CLK153M6 (3UL) /*!< 153.6 MHz */
#define MCPLL_MA_MA_CLK76M8 (4UL) /*!< 76.8 MHz */
#define MCPLL_MA_MA_CLK163M84 (5UL) /*!< 163.84 MHz */
#define MCPLL_MA_MA_REFIN (6UL) /*!< 32 MHz */
#define MCPLL_MA_MA_GND (7UL) /*!< Nothing */

/* Register: MCPLL_MB */
/* Description: Post division ratio for OUTB */

/* Bits 2..0 : Post division ratio for OUTB */
#define MCPLL_MB_MB_Pos (0UL) /*!< Position of MB field. */
#define MCPLL_MB_MB_Msk (0x7UL << MCPLL_MB_MB_Pos) /*!< Bit mask of MB field. */
#define MCPLL_MB_MB_BYPASS (0UL) /*!< Bypass */
#define MCPLL_MB_MB_CLK614M4 (1UL) /*!< 614.4 MHz */
#define MCPLL_MB_MB_CLK307M2 (2UL) /*!< 307.2 MHz */
#define MCPLL_MB_MB_CLK153M6 (3UL) /*!< 153.6 MHz */
#define MCPLL_MB_MB_CLK76M8 (4UL) /*!< 76.8 MHz */
#define MCPLL_MB_MB_CLK38M4 (5UL) /*!< 38.4 MHz */
#define MCPLL_MB_MB_REFIN (6UL) /*!< 32 MHz */
#define MCPLL_MB_MB_GND (7UL) /*!< Nothing */

/* Register: MCPLL_MC */
/* Description: Post division ratio for OUTC */

/* Bits 2..0 : Post division ratio for OUTC */
#define MCPLL_MC_MC_Pos (0UL) /*!< Position of MC field. */
#define MCPLL_MC_MC_Msk (0x7UL << MCPLL_MC_MC_Pos) /*!< Bit mask of MC field. */
#define MCPLL_MC_MC_BYPASS (0UL) /*!< Bypass */
#define MCPLL_MC_MC_CLK614M4 (1UL) /*!< 614.4 MHz */
#define MCPLL_MC_MC_CLK307M2 (2UL) /*!< 307.2 MHz */
#define MCPLL_MC_MC_CLK153M6 (3UL) /*!< 153.6 MHz */
#define MCPLL_MC_MC_CLK76M8 (4UL) /*!< 76.8 MHz */
#define MCPLL_MC_MC_CLK163M84 (5UL) /*!< 163.84 MHz */
#define MCPLL_MC_MC_REFIN (6UL) /*!< 32 MHz */
#define MCPLL_MC_MC_GND (7UL) /*!< Nothing */

/* Register: MCPLL_MD */
/* Description: Post division ratio for OUTD */

/* Bits 2..0 : Post division ratio for OUTD */
#define MCPLL_MD_MD_Pos (0UL) /*!< Position of MD field. */
#define MCPLL_MD_MD_Msk (0x7UL << MCPLL_MD_MD_Pos) /*!< Bit mask of MD field. */
#define MCPLL_MD_MD_BYPASS (0UL) /*!< Bypass */
#define MCPLL_MD_MD_CLK614M4 (1UL) /*!< 614.4 MHz */
#define MCPLL_MD_MD_CLK307M2 (2UL) /*!< 307.2 MHz */
#define MCPLL_MD_MD_CLK153M6 (3UL) /*!< 153.6 MHz */
#define MCPLL_MD_MD_CLK76M8 (4UL) /*!< 76.8 MHz */
#define MCPLL_MD_MD_CLK38M4 (5UL) /*!< 38.4 MHz */
#define MCPLL_MD_MD_REFIN (6UL) /*!< 32 MHz */
#define MCPLL_MD_MD_GND (7UL) /*!< Nothing */

/* Register: MCPLL_FORCEINLOCK */
/* Description: Force MCPLL in lock */

/* Bits 1..0 : Force MCPLL in lock (value) */
#define MCPLL_FORCEINLOCK_FORCEINLOCK_Pos (0UL) /*!< Position of FORCEINLOCK field. */
#define MCPLL_FORCEINLOCK_FORCEINLOCK_Msk (0x3UL << MCPLL_FORCEINLOCK_FORCEINLOCK_Pos) /*!< Bit mask of FORCEINLOCK field. */

/* Register: MCPLL_RESET */
/* Description: Reset MCPLL */

/* Bit 0 : Software reset (ARSTSD) */
#define MCPLL_RESET_RESET_Pos (0UL) /*!< Position of RESET field. */
#define MCPLL_RESET_RESET_Msk (0x1UL << MCPLL_RESET_RESET_Pos) /*!< Bit mask of RESET field. */

/* Register: MCPLL_SPARE */
/* Description: Spare signals */

/* Bits 3..0 : Spare signals */
#define MCPLL_SPARE_SPARE_Pos (0UL) /*!< Position of SPARE field. */
#define MCPLL_SPARE_SPARE_Msk (0xFUL << MCPLL_SPARE_SPARE_Pos) /*!< Bit mask of SPARE field. */

/* Register: MCPLL_OVERRIDE_MCPLL */
/* Description: Override for MCPLL power switch */

/* Bit 31 : Enable override */
#define MCPLL_OVERRIDE_MCPLL_ENABLE_Pos (31UL) /*!< Position of ENABLE field. */
#define MCPLL_OVERRIDE_MCPLL_ENABLE_Msk (0x1UL << MCPLL_OVERRIDE_MCPLL_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define MCPLL_OVERRIDE_MCPLL_ENABLE_NoOverride (0UL) /*!< No override enabled */
#define MCPLL_OVERRIDE_MCPLL_ENABLE_Override (1UL) /*!< Override enabled */

