adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 2 : Write '1' to enable interrupt for event CTSTARTED */
#define RCOSC32K_INTENSET_CTSTARTED_Pos (2UL) /*!< Position of CTSTARTED field. */
#define RCOSC32K_INTENSET_CTSTARTED_Msk (0x1UL << RCOSC32K_INTENSET_CTSTARTED_Pos) /*!< Bit mask of CTSTARTED field. */
#define RCOSC32K_INTENSET_CTSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define RCOSC32K_INTENSET_CTSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define RCOSC32K_INTENSET_CTSTARTED_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event DONE */
#define RCOSC32K_INTENSET_DONE_Pos (1UL) /*!< Position of DONE field. */
#define RCOSC32K_INTENSET_DONE_Msk (0x1UL << RCOSC32K_INTENSET_DONE_Pos) /*!< Bit mask of DONE field. */
#define RCOSC32K_INTENSET_DONE_Disabled (0UL) /*!< Read: Disabled */
#define RCOSC32K_INTENSET_DONE_Enabled (1UL) /*!< Read: Enabled */
#define RCOSC32K_INTENSET_DONE_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event CTTO */
#define RCOSC32K_INTENSET_CTTO_Pos (0UL) /*!< Position of CTTO field. */
#define RCOSC32K_INTENSET_CTTO_Msk (0x1UL << RCOSC32K_INTENSET_CTTO_Pos) /*!< Bit mask of CTTO field. */
#define RCOSC32K_INTENSET_CTTO_Disabled (0UL) /*!< Read: Disabled */
#define RCOSC32K_INTENSET_CTTO_Enabled (1UL) /*!< Read: Enabled */
#define RCOSC32K_INTENSET_CTTO_Set (1UL) /*!< Enable */

/* Register: RCOSC32K_INTENCLR */
/* Description: Disable interrupt */

/* Bit 3 : Write '1' to disable interrupt for event CTSTOPPED */
#define RCOSC32K_INTENCLR_CTSTOPPED_Pos (3UL) /*!< Position of CTSTOPPED field. */
#define RCOSC32K_INTENCLR_CTSTOPPED_Msk (0x1UL << RCOSC32K_INTENCLR_CTSTOPPED_Pos) /*!< Bit mask of CTSTOPPED field. */
#define RCOSC32K_INTENCLR_CTSTOPPED_Disabled (0UL) /*!< Read: Disabled */
#define RCOSC32K_INTENCLR_CTSTOPPED_Enabled (1UL) /*!< Read: Enabled */
#define RCOSC32K_INTENCLR_CTSTOPPED_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event CTSTARTED */
#define RCOSC32K_INTENCLR_CTSTARTED_Pos (2UL) /*!< Position of CTSTARTED field. */
#define RCOSC32K_INTENCLR_CTSTARTED_Msk (0x1UL << RCOSC32K_INTENCLR_CTSTARTED_Pos) /*!< Bit mask of CTSTARTED field. */
#define RCOSC32K_INTENCLR_CTSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define RCOSC32K_INTENCLR_CTSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define RCOSC32K_INTENCLR_CTSTARTED_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event DONE */
#define RCOSC32K_INTENCLR_DONE_Pos (1UL) /*!< Position of DONE field. */
#define RCOSC32K_INTENCLR_DONE_Msk (0x1UL << RCOSC32K_INTENCLR_DONE_Pos) /*!< Bit mask of DONE field. */
#define RCOSC32K_INTENCLR_DONE_Disabled (0UL) /*!< Read: Disabled */
#define RCOSC32K_INTENCLR_DONE_Enabled (1UL) /*!< Read: Enabled */
#define RCOSC32K_INTENCLR_DONE_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event CTTO */
#define RCOSC32K_INTENCLR_CTTO_Pos (0UL) /*!< Position of CTTO field. */
#define RCOSC32K_INTENCLR_CTTO_Msk (0x1UL << RCOSC32K_INTENCLR_CTTO_Pos) /*!< Bit mask of CTTO field. */
#define RCOSC32K_INTENCLR_CTTO_Disabled (0UL) /*!< Read: Disabled */
#define RCOSC32K_INTENCLR_CTTO_Enabled (1UL) /*!< Read: Enabled */
#define RCOSC32K_INTENCLR_CTTO_Clear (1UL) /*!< Disable */

/* Register: RCOSC32K_RCOSC32KIFINE */
/* Description: Fine calibration read value for 32.768 kHz RC oscillator */

/* Bits 9..0 : Fine calibration read value for 32.768 kHz RC oscillator */
#define RCOSC32K_RCOSC32KIFINE_RCOSC32KIFINE_Pos (0UL) /*!< Position of RCOSC32KIFINE field. */
#define RCOSC32K_RCOSC32KIFINE_RCOSC32KIFINE_Msk (0x3FFUL << RCOSC32K_RCOSC32KIFINE_RCOSC32KIFINE_Pos) /*!< Bit mask of RCOSC32KIFINE field. */

/* Register: RCOSC32K_RCOSC32KICOARSE */
/* Description: Coarse calibration read value for 32.768 kHz RC oscillator */

/* Bits 5..0 : Coarse calibration read value for 32.768 kHz RC oscillator */
#define RCOSC32K_RCOSC32KICOARSE_RCOSC32KICOARSE_Pos (0UL) /*!< Position of RCOSC32KICOARSE field. */
#define RCOSC32K_RCOSC32KICOARSE_RCOSC32KICOARSE_Msk (0x3FUL << RCOSC32K_RCOSC32KICOARSE_RCOSC32KICOARSE_Pos) /*!< Bit mask of RCOSC32KICOARSE field. */

/* Register: RCOSC32K_RCOSC32KICALTEST */
/* Description: 32.768 kHz RC oscillator calibration debug register NOTE: This register should not be written to while the RCOSC source is running. */

/* Bit 1 : Disable calSync auto-calibration */
#define RCOSC32K_RCOSC32KICALTEST_CALSYNCDISABLE_Pos (1UL) /*!< Position of CALSYNCDISABLE field. */
#define RCOSC32K_RCOSC32KICALTEST_CALSYNCDISABLE_Msk (0x1UL << RCOSC32K_RCOSC32KICALTEST_CALSYNCDISABLE_Pos) /*!< Bit mask of CALSYNCDISABLE field. */
#define RCOSC32K_RCOSC32KICALTEST_CALSYNCDISABLE_Enabled (0UL) /*!< calSync auto-calibration enabled */
#define RCOSC32K_RCOSC32KICALTEST_CALSYNCDISABLE_Disabled (1UL) /*!< calSync auto-calibration disabled */

/* Bit 0 : Enable debug pins: calSync on P0.8 (input); ck32Ki on P0.13 (output); rcosc32KiCalib on P0.19 (output) */
#define RCOSC32K_RCOSC32KICALTEST_DEBUGPINSEN_Pos (0UL) /*!< Position of DEBUGPINSEN field. */
#define RCOSC32K_RCOSC32KICALTEST_DEBUGPINSEN_Msk (0x1UL << RCOSC32K_RCOSC32KICALTEST_DEBUGPINSEN_Pos) /*!< Bit mask of DEBUGPINSEN field. */
#define RCOSC32K_RCOSC32KICALTEST_DEBUGPINSEN_Disabled (0UL) /*!< Pins in normal operation */
#define RCOSC32K_RCOSC32KICALTEST_DEBUGPINSEN_Enabled (1UL) /*!< Pins mapped for debug */

/* Register: RCOSC32K_CTIV */
/* Description: Calibration timer interval NOTE: This register should not be written to while the RCOSC source is running. */

/* Bits 6..0 : Calibration timer interval in multiple of 0.25 seconds. Range: 0.25 seconds to 31.75 seconds. */
#define RCOSC32K_CTIV_CTIV_Pos (0UL) /*!< Position of CTIV field. */
#define RCOSC32K_CTIV_CTIV_Msk (0x7FUL << RCOSC32K_CTIV_CTIV_Pos) /*!< Bit mask of CTIV field. */

/* Register: RCOSC32K_RCOSC32KICALLENGTH */
/* Description: 32kHz RC oscillator calibration length This value is read from FICR */

/* Bits 2..0 : 32kHz RC oscillator calibration length in number of cycles */
#define RCOSC32K_RCOSC32KICALLENGTH_RCOSC32KICALLENGTH_Pos (0UL) /*!< Position of RCOSC32KICALLENGTH field. */
#define RCOSC32K_RCOSC32KICALLENGTH_RCOSC32KICALLENGTH_Msk (0x7UL << RCOSC32K_RCOSC32KICALLENGTH_RCOSC32KICALLENGTH_Pos) /*!< Bit mask of RCOSC32KICALLENGTH field. */
#define RCOSC32K_RCOSC32KICALLENGTH_RCOSC32KICALLENGTH_N64 (0UL) /*!< 64 cycles */
#define RCOSC32K_RCOSC32KICALLENGTH_RCOSC32KICALLENGTH_N128 (1UL) /*!< 128 cycles */
#define RCOSC32K_RCOSC32KICALLENGTH_RCOSC32KICALLENGTH_N256 (2UL) /*!< 256 cycles */
#define RCOSC32K_RCOSC32KICALLENGTH_RCOSC32KICALLENGTH_N512 (3UL) /*!< 512 cycles */

