adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Register: SHA_H6_R */
/* Description: Final result H6_R (SHA-256), H3_R (SHA-1) in reversed byte order. Updated after every 512bit block calculated. */

/* Bits 31..0 : Data6 */
#define SHA_H6_R_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H6_R_Data_Msk (0xFFFFFFFFUL << SHA_H6_R_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H5_R */
/* Description: Final result H5_R (SHA-256), H2_R (SHA-1) in reversed byte order. Updated after every 512bit block calculated. */

/* Bits 31..0 : Data5 */
#define SHA_H5_R_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H5_R_Data_Msk (0xFFFFFFFFUL << SHA_H5_R_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H4_R */
/* Description: Final result H4_R (SHA-256), H1_R (SHA-1) in reversed byte order. Updated after every 512bit block calculated. */

/* Bits 31..0 : Data4 */
#define SHA_H4_R_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H4_R_Data_Msk (0xFFFFFFFFUL << SHA_H4_R_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H3_R */
/* Description: Final result H3_R (SHA-256), H0_R (SHA-1) in reversed byte order. Updated after every 512bit block calculated. */

/* Bits 31..0 : Data3 */
#define SHA_H3_R_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H3_R_Data_Msk (0xFFFFFFFFUL << SHA_H3_R_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H2_R */
/* Description: Final result H2_R (SHA-256) in reversed byte order. Updated after every 512bit block calculated. */

/* Bits 31..0 : Data2 */
#define SHA_H2_R_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H2_R_Data_Msk (0xFFFFFFFFUL << SHA_H2_R_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H1_R */
/* Description: Final result H1_R (SHA-256) in reversed byte order. Updated after every 512bit block calculated. */

/* Bits 31..0 : Data1 */
#define SHA_H1_R_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H1_R_Data_Msk (0xFFFFFFFFUL << SHA_H1_R_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_H0_R */
/* Description: Final result H0_R (SHA-256) in reversed byte order. Updated after every 512bit block calculated.. */

/* Bits 31..0 : Data0 */
#define SHA_H0_R_Data_Pos (0UL) /*!< Position of Data field. */
#define SHA_H0_R_Data_Msk (0xFFFFFFFFUL << SHA_H0_R_Data_Pos) /*!< Bit mask of Data field. */

/* Register: SHA_INBYTECOUNT */
/* Description: Bytes transferred in current job. */

/* Bits 31..0 : Bytes transferred in current job. */
#define SHA_INBYTECOUNT_INBYTECOUNT_Pos (0UL) /*!< Position of INBYTECOUNT field. */
#define SHA_INBYTECOUNT_INBYTECOUNT_Msk (0xFFFFFFFFUL << SHA_INBYTECOUNT_INBYTECOUNT_Pos) /*!< Bit mask of INBYTECOUNT field. */

/* Register: SHA_INJOBPTR */
/* Description: Input job pointer. */

/* Bits 31..0 : Input job pointer. */
#define SHA_INJOBPTR_INJOBPTR_Pos (0UL) /*!< Position of INJOBPTR field. */
#define SHA_INJOBPTR_INJOBPTR_Msk (0xFFFFFFFFUL << SHA_INJOBPTR_INJOBPTR_Pos) /*!< Bit mask of INJOBPTR field. */


/* Peripheral: SIMIF */
/* Description: SIM card interface */

/* Register: SIMIF_TASKS_DMASTARTRX */
/* Description: start DMA transfer from SIM card to memory */

/* Bit 0 : start DMA transfer from SIM card to memory */
#define SIMIF_TASKS_DMASTARTRX_TASKS_DMASTARTRX_Pos (0UL) /*!< Position of TASKS_DMASTARTRX field. */
#define SIMIF_TASKS_DMASTARTRX_TASKS_DMASTARTRX_Msk (0x1UL << SIMIF_TASKS_DMASTARTRX_TASKS_DMASTARTRX_Pos) /*!< Bit mask of TASKS_DMASTARTRX field. */
#define SIMIF_TASKS_DMASTARTRX_TASKS_DMASTARTRX_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_DMASTOPRX */
/* Description: stop DMA transfer from SIM card to memory */

/* Bit 0 : stop DMA transfer from SIM card to memory */
#define SIMIF_TASKS_DMASTOPRX_TASKS_DMASTOPRX_Pos (0UL) /*!< Position of TASKS_DMASTOPRX field. */
#define SIMIF_TASKS_DMASTOPRX_TASKS_DMASTOPRX_Msk (0x1UL << SIMIF_TASKS_DMASTOPRX_TASKS_DMASTOPRX_Pos) /*!< Bit mask of TASKS_DMASTOPRX field. */
#define SIMIF_TASKS_DMASTOPRX_TASKS_DMASTOPRX_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_DMASTARTTX */
/* Description: start DMA transfer from memory  to SIM card */

/* Bit 0 : start DMA transfer from memory  to SIM card */
#define SIMIF_TASKS_DMASTARTTX_TASKS_DMASTARTTX_Pos (0UL) /*!< Position of TASKS_DMASTARTTX field. */
#define SIMIF_TASKS_DMASTARTTX_TASKS_DMASTARTTX_Msk (0x1UL << SIMIF_TASKS_DMASTARTTX_TASKS_DMASTARTTX_Pos) /*!< Bit mask of TASKS_DMASTARTTX field. */
#define SIMIF_TASKS_DMASTARTTX_TASKS_DMASTARTTX_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_DMASTOPTX */
/* Description: start DMA transfer from memory  to SIM card */

/* Bit 0 : start DMA transfer from memory  to SIM card */
#define SIMIF_TASKS_DMASTOPTX_TASKS_DMASTOPTX_Pos (0UL) /*!< Position of TASKS_DMASTOPTX field. */
#define SIMIF_TASKS_DMASTOPTX_TASKS_DMASTOPTX_Msk (0x1UL << SIMIF_TASKS_DMASTOPTX_TASKS_DMASTOPTX_Pos) /*!< Bit mask of TASKS_DMASTOPTX field. */
#define SIMIF_TASKS_DMASTOPTX_TASKS_DMASTOPTX_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_RSTSET */
/* Description: Set SIM card reset signal */

/* Bit 0 : Set SIM card reset signal */
#define SIMIF_TASKS_RSTSET_TASKS_RSTSET_Pos (0UL) /*!< Position of TASKS_RSTSET field. */
#define SIMIF_TASKS_RSTSET_TASKS_RSTSET_Msk (0x1UL << SIMIF_TASKS_RSTSET_TASKS_RSTSET_Pos) /*!< Bit mask of TASKS_RSTSET field. */
#define SIMIF_TASKS_RSTSET_TASKS_RSTSET_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_RSTCLEAR */
/* Description: Clear SIM card reset signal */

/* Bit 0 : Clear SIM card reset signal */
#define SIMIF_TASKS_RSTCLEAR_TASKS_RSTCLEAR_Pos (0UL) /*!< Position of TASKS_RSTCLEAR field. */
#define SIMIF_TASKS_RSTCLEAR_TASKS_RSTCLEAR_Msk (0x1UL << SIMIF_TASKS_RSTCLEAR_TASKS_RSTCLEAR_Pos) /*!< Bit mask of TASKS_RSTCLEAR field. */
#define SIMIF_TASKS_RSTCLEAR_TASKS_RSTCLEAR_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_RESET */
/* Description: Reset everything */

/* Bit 0 : Reset everything */
#define SIMIF_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field. */
#define SIMIF_TASKS_RESET_TASKS_RESET_Msk (0x1UL << SIMIF_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field. */
#define SIMIF_TASKS_RESET_TASKS_RESET_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_UARTRX */
/* Description: Start Uart for Rx access */

/* Bit 0 : Start Uart for Rx access */
#define SIMIF_TASKS_UARTRX_TASKS_UARTRX_Pos (0UL) /*!< Position of TASKS_UARTRX field. */
#define SIMIF_TASKS_UARTRX_TASKS_UARTRX_Msk (0x1UL << SIMIF_TASKS_UARTRX_TASKS_UARTRX_Pos) /*!< Bit mask of TASKS_UARTRX field. */
#define SIMIF_TASKS_UARTRX_TASKS_UARTRX_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_UARTTX */
/* Description: Start Uart for Tx access */

/* Bit 0 : Start Uart for Tx access */
#define SIMIF_TASKS_UARTTX_TASKS_UARTTX_Pos (0UL) /*!< Position of TASKS_UARTTX field. */
#define SIMIF_TASKS_UARTTX_TASKS_UARTTX_Msk (0x1UL << SIMIF_TASKS_UARTTX_TASKS_UARTTX_Pos) /*!< Bit mask of TASKS_UARTTX field. */
#define SIMIF_TASKS_UARTTX_TASKS_UARTTX_Trigger (1UL) /*!< Trigger task */

/* Register: SIMIF_TASKS_STARTWRITEFROMREG */
/* Description: Write test data from Ahb test reg to Ahb Rx bus */

