adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 0 : T=1 unrecognized (S or R) block (with correct LRC) stored in RX_DATA */
#define SIMIF_EVENTS_T1_NON_I_BLOCK_EVENTS_T1_NON_I_BLOCK_Pos (0UL) /*!< Position of EVENTS_T1_NON_I_BLOCK field. */
#define SIMIF_EVENTS_T1_NON_I_BLOCK_EVENTS_T1_NON_I_BLOCK_Msk (0x1UL << SIMIF_EVENTS_T1_NON_I_BLOCK_EVENTS_T1_NON_I_BLOCK_Pos) /*!< Bit mask of EVENTS_T1_NON_I_BLOCK field. */
#define SIMIF_EVENTS_T1_NON_I_BLOCK_EVENTS_T1_NON_I_BLOCK_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_T1_NON_I_BLOCK_EVENTS_T1_NON_I_BLOCK_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_T1_LEN_ERROR */
/* Description: T=1 LEN = 255 */

/* Bit 0 : T=1 LEN = 255 */
#define SIMIF_EVENTS_T1_LEN_ERROR_EVENTS_T1_LEN_ERROR_Pos (0UL) /*!< Position of EVENTS_T1_LEN_ERROR field. */
#define SIMIF_EVENTS_T1_LEN_ERROR_EVENTS_T1_LEN_ERROR_Msk (0x1UL << SIMIF_EVENTS_T1_LEN_ERROR_EVENTS_T1_LEN_ERROR_Pos) /*!< Bit mask of EVENTS_T1_LEN_ERROR field. */
#define SIMIF_EVENTS_T1_LEN_ERROR_EVENTS_T1_LEN_ERROR_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_T1_LEN_ERROR_EVENTS_T1_LEN_ERROR_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_EDC_ERROR */
/* Description: T=1 EDC error */

/* Bit 0 : T=1 EDC error */
#define SIMIF_EVENTS_EDC_ERROR_EVENTS_EDC_ERROR_Pos (0UL) /*!< Position of EVENTS_EDC_ERROR field. */
#define SIMIF_EVENTS_EDC_ERROR_EVENTS_EDC_ERROR_Msk (0x1UL << SIMIF_EVENTS_EDC_ERROR_EVENTS_EDC_ERROR_Pos) /*!< Bit mask of EVENTS_EDC_ERROR field. */
#define SIMIF_EVENTS_EDC_ERROR_EVENTS_EDC_ERROR_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_EDC_ERROR_EVENTS_EDC_ERROR_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_NAD_ERROR */
/* Description: T=1 NAD error */

/* Bit 0 : T=1 NAD error */
#define SIMIF_EVENTS_NAD_ERROR_EVENTS_NAD_ERROR_Pos (0UL) /*!< Position of EVENTS_NAD_ERROR field. */
#define SIMIF_EVENTS_NAD_ERROR_EVENTS_NAD_ERROR_Msk (0x1UL << SIMIF_EVENTS_NAD_ERROR_EVENTS_NAD_ERROR_Pos) /*!< Bit mask of EVENTS_NAD_ERROR field. */
#define SIMIF_EVENTS_NAD_ERROR_EVENTS_NAD_ERROR_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_NAD_ERROR_EVENTS_NAD_ERROR_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_EVENTS_ERROR_COUNT_MAX */
/* Description: number of unsuccessful rx or tx operations equals max value */

/* Bit 0 : number of unsuccessful rx or tx operations equals max value */
#define SIMIF_EVENTS_EVENTS_ERROR_COUNT_MAX_EVENTS_EVENTS_ERROR_COUNT_MAX_Pos (0UL) /*!< Position of EVENTS_EVENTS_ERROR_COUNT_MAX field. */
#define SIMIF_EVENTS_EVENTS_ERROR_COUNT_MAX_EVENTS_EVENTS_ERROR_COUNT_MAX_Msk (0x1UL << SIMIF_EVENTS_EVENTS_ERROR_COUNT_MAX_EVENTS_EVENTS_ERROR_COUNT_MAX_Pos) /*!< Bit mask of EVENTS_EVENTS_ERROR_COUNT_MAX field. */
#define SIMIF_EVENTS_EVENTS_ERROR_COUNT_MAX_EVENTS_EVENTS_ERROR_COUNT_MAX_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_EVENTS_ERROR_COUNT_MAX_EVENTS_EVENTS_ERROR_COUNT_MAX_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_EVENTS_T1_RX_MORE */
/* Description: More bit high in PCB of Rx T=1 I block */

/* Bit 0 : More bit high in PCB of Rx T=1 I block */
#define SIMIF_EVENTS_EVENTS_T1_RX_MORE_EVENTS_EVENTS_T1_RX_MORE_Pos (0UL) /*!< Position of EVENTS_EVENTS_T1_RX_MORE field. */
#define SIMIF_EVENTS_EVENTS_T1_RX_MORE_EVENTS_EVENTS_T1_RX_MORE_Msk (0x1UL << SIMIF_EVENTS_EVENTS_T1_RX_MORE_EVENTS_EVENTS_T1_RX_MORE_Pos) /*!< Bit mask of EVENTS_EVENTS_T1_RX_MORE field. */
#define SIMIF_EVENTS_EVENTS_T1_RX_MORE_EVENTS_EVENTS_T1_RX_MORE_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_EVENTS_T1_RX_MORE_EVENTS_EVENTS_T1_RX_MORE_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_EVENTS_EVENTS_T1_RX_FRAME_END */
/* Description: Len byte + 1 bytes of T1 Rx data received */

/* Bit 0 : Len byte + 1 bytes of T1 Rx data received */
#define SIMIF_EVENTS_EVENTS_T1_RX_FRAME_END_EVENTS_EVENTS_T1_RX_FRAME_END_Pos (0UL) /*!< Position of EVENTS_EVENTS_T1_RX_FRAME_END field. */
#define SIMIF_EVENTS_EVENTS_T1_RX_FRAME_END_EVENTS_EVENTS_T1_RX_FRAME_END_Msk (0x1UL << SIMIF_EVENTS_EVENTS_T1_RX_FRAME_END_EVENTS_EVENTS_T1_RX_FRAME_END_Pos) /*!< Bit mask of EVENTS_EVENTS_T1_RX_FRAME_END field. */
#define SIMIF_EVENTS_EVENTS_T1_RX_FRAME_END_EVENTS_EVENTS_T1_RX_FRAME_END_NotGenerated (0UL) /*!< Event not generated */
#define SIMIF_EVENTS_EVENTS_T1_RX_FRAME_END_EVENTS_EVENTS_T1_RX_FRAME_END_Generated (1UL) /*!< Event generated */

/* Register: SIMIF_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 4 : Shortcut between event DMA_TX_DONE and task PROTOCOLNONSET */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLNONSET_Pos (4UL) /*!< Position of DMA_TX_DONE_PROTOCOLNONSET field. */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLNONSET_Msk (0x1UL << SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLNONSET_Pos) /*!< Bit mask of DMA_TX_DONE_PROTOCOLNONSET field. */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLNONSET_Disabled (0UL) /*!< Disable shortcut */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLNONSET_Enabled (1UL) /*!< Enable shortcut */

/* Bit 3 : Shortcut between event DMA_TX_DONE and task PROTOCOLT1SET */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLT1SET_Pos (3UL) /*!< Position of DMA_TX_DONE_PROTOCOLT1SET field. */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLT1SET_Msk (0x1UL << SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLT1SET_Pos) /*!< Bit mask of DMA_TX_DONE_PROTOCOLT1SET field. */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLT1SET_Disabled (0UL) /*!< Disable shortcut */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLT1SET_Enabled (1UL) /*!< Enable shortcut */

/* Bit 2 : Shortcut between event DMA_TX_DONE and task PROTOCOLT0SET */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLT0SET_Pos (2UL) /*!< Position of DMA_TX_DONE_PROTOCOLT0SET field. */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLT0SET_Msk (0x1UL << SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLT0SET_Pos) /*!< Bit mask of DMA_TX_DONE_PROTOCOLT0SET field. */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLT0SET_Disabled (0UL) /*!< Disable shortcut */
#define SIMIF_SHORTS_DMA_TX_DONE_PROTOCOLT0SET_Enabled (1UL) /*!< Enable shortcut */

/* Bit 1 : Shortcut between event DMA_TX_DONE and task UARTRX */
#define SIMIF_SHORTS_DMA_TX_DONE_UARTRX_Pos (1UL) /*!< Position of DMA_TX_DONE_UARTRX field. */
#define SIMIF_SHORTS_DMA_TX_DONE_UARTRX_Msk (0x1UL << SIMIF_SHORTS_DMA_TX_DONE_UARTRX_Pos) /*!< Bit mask of DMA_TX_DONE_UARTRX field. */
#define SIMIF_SHORTS_DMA_TX_DONE_UARTRX_Disabled (0UL) /*!< Disable shortcut */
#define SIMIF_SHORTS_DMA_TX_DONE_UARTRX_Enabled (1UL) /*!< Enable shortcut */

/* Bit 0 : Shortcut between event DMA_TX_DONE and task DMASTARTRX */
#define SIMIF_SHORTS_DMA_TX_DONE_DMASTARTRX_Pos (0UL) /*!< Position of DMA_TX_DONE_DMASTARTRX field. */
#define SIMIF_SHORTS_DMA_TX_DONE_DMASTARTRX_Msk (0x1UL << SIMIF_SHORTS_DMA_TX_DONE_DMASTARTRX_Pos) /*!< Bit mask of DMA_TX_DONE_DMASTARTRX field. */
#define SIMIF_SHORTS_DMA_TX_DONE_DMASTARTRX_Disabled (0UL) /*!< Disable shortcut */
#define SIMIF_SHORTS_DMA_TX_DONE_DMASTARTRX_Enabled (1UL) /*!< Enable shortcut */

