adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bits 15..8 : Second Rx byte from card */
#define SIMIF_RXPROLOGUEDATA_RXBYTE1_Pos (8UL) /*!< Position of RXBYTE1 field. */
#define SIMIF_RXPROLOGUEDATA_RXBYTE1_Msk (0xFFUL << SIMIF_RXPROLOGUEDATA_RXBYTE1_Pos) /*!< Bit mask of RXBYTE1 field. */

/* Bits 7..0 : First Rx byte from card */
#define SIMIF_RXPROLOGUEDATA_RXBYTE0_Pos (0UL) /*!< Position of RXBYTE0 field. */
#define SIMIF_RXPROLOGUEDATA_RXBYTE0_Msk (0xFFUL << SIMIF_RXPROLOGUEDATA_RXBYTE0_Pos) /*!< Bit mask of RXBYTE0 field. */

/* Register: SIMIF_UARTENABLE */
/* Description: UART Enable */

/* Bit 0 : UART master enable */
#define SIMIF_UARTENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define SIMIF_UARTENABLE_ENABLE_Msk (0x1UL << SIMIF_UARTENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Register: SIMIF_UARTRXENABLE */
/* Description: UART Rx Enable */

/* Bit 0 : UART Rx enable */
#define SIMIF_UARTRXENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define SIMIF_UARTRXENABLE_ENABLE_Msk (0x1UL << SIMIF_UARTRXENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Register: SIMIF_UARTTXENABLE */
/* Description: UART Tx Enable */

/* Bit 0 : UART Tx enable */
#define SIMIF_UARTTXENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define SIMIF_UARTTXENABLE_ENABLE_Msk (0x1UL << SIMIF_UARTTXENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */

/* Register: SIMIF_DMARXADDR */
/* Description: DMA access  buffer RAM start address */

/* Bits 31..0 : DMA access  buffer RAM start address */
#define SIMIF_DMARXADDR_DMARXSTARTADDRESS_Pos (0UL) /*!< Position of DMARXSTARTADDRESS field. */
#define SIMIF_DMARXADDR_DMARXSTARTADDRESS_Msk (0xFFFFFFFFUL << SIMIF_DMARXADDR_DMARXSTARTADDRESS_Pos) /*!< Bit mask of DMARXSTARTADDRESS field. */

/* Register: SIMIF_DMARXBUFFERSIZE */
/* Description: Byte count to receive in Dma Rx operation */

/* Bits 15..0 : Byte count to receive in Dma Rx operation */
#define SIMIF_DMARXBUFFERSIZE_DMARXBUFFERSIZE_Pos (0UL) /*!< Position of DMARXBUFFERSIZE field. */
#define SIMIF_DMARXBUFFERSIZE_DMARXBUFFERSIZE_Msk (0xFFFFUL << SIMIF_DMARXBUFFERSIZE_DMARXBUFFERSIZE_Pos) /*!< Bit mask of DMARXBUFFERSIZE field. */

/* Register: SIMIF_DMARXBYTECOUNT */
/* Description: Byte count received in latest Dma Rx operation */

/* Bits 15..0 : Byte count received in latest Dma Rx operation */
#define SIMIF_DMARXBYTECOUNT_DMARXBYTECOUNT_Pos (0UL) /*!< Position of DMARXBYTECOUNT field. */
#define SIMIF_DMARXBYTECOUNT_DMARXBYTECOUNT_Msk (0xFFFFUL << SIMIF_DMARXBYTECOUNT_DMARXBYTECOUNT_Pos) /*!< Bit mask of DMARXBYTECOUNT field. */

/* Register: SIMIF_DMARXENABLE */
/* Description: Enable for rx dma */

/* Bit 0 : Enable for rx dma */
#define SIMIF_DMARXENABLE_DMARXENABLE_Pos (0UL) /*!< Position of DMARXENABLE field. */
#define SIMIF_DMARXENABLE_DMARXENABLE_Msk (0x1UL << SIMIF_DMARXENABLE_DMARXENABLE_Pos) /*!< Bit mask of DMARXENABLE field. */

/* Register: SIMIF_DMARXSELECTLIST */
/* Description: Rx select address from list */

/* Bits 1..0 : Select address from list */
#define SIMIF_DMARXSELECTLIST_DMARXSELECTLIST_Pos (0UL) /*!< Position of DMARXSELECTLIST field. */
#define SIMIF_DMARXSELECTLIST_DMARXSELECTLIST_Msk (0x3UL << SIMIF_DMARXSELECTLIST_DMARXSELECTLIST_Pos) /*!< Bit mask of DMARXSELECTLIST field. */

/* Register: SIMIF_DMATXADDR */
/* Description: Start address for DMA access in buffer RAM */

/* Bits 31..0 : Start address for DMA access in buffer RAM */
#define SIMIF_DMATXADDR_DMATXSTARTADDRESS_Pos (0UL) /*!< Position of DMATXSTARTADDRESS field. */
#define SIMIF_DMATXADDR_DMATXSTARTADDRESS_Msk (0xFFFFFFFFUL << SIMIF_DMATXADDR_DMATXSTARTADDRESS_Pos) /*!< Bit mask of DMATXSTARTADDRESS field. */

/* Register: SIMIF_DMATXBUFFERSIZE */
/* Description: Byte count to transmit in Dma Rx operation */

/* Bits 15..0 : Byte count to transmit in Dma Tx operation */
#define SIMIF_DMATXBUFFERSIZE_DMATXBUFFERSIZE_Pos (0UL) /*!< Position of DMATXBUFFERSIZE field. */
#define SIMIF_DMATXBUFFERSIZE_DMATXBUFFERSIZE_Msk (0xFFFFUL << SIMIF_DMATXBUFFERSIZE_DMATXBUFFERSIZE_Pos) /*!< Bit mask of DMATXBUFFERSIZE field. */

/* Register: SIMIF_DMATXBYTECOUNT */
/* Description: Byte count transmitted in latest Dma Tx operation */

/* Bits 15..0 : Byte count transmitted in latest Dma Tx operation */
#define SIMIF_DMATXBYTECOUNT_DMATXBYTECOUNT_Pos (0UL) /*!< Position of DMATXBYTECOUNT field. */
#define SIMIF_DMATXBYTECOUNT_DMATXBYTECOUNT_Msk (0xFFFFUL << SIMIF_DMATXBYTECOUNT_DMATXBYTECOUNT_Pos) /*!< Bit mask of DMATXBYTECOUNT field. */

/* Register: SIMIF_DMATXENABLE */
/* Description: Enable for rx dma */

/* Bit 0 : Enable for rx dma */
#define SIMIF_DMATXENABLE_DMATXENABLE_Pos (0UL) /*!< Position of DMATXENABLE field. */
#define SIMIF_DMATXENABLE_DMATXENABLE_Msk (0x1UL << SIMIF_DMATXENABLE_DMATXENABLE_Pos) /*!< Bit mask of DMATXENABLE field. */

/* Register: SIMIF_DMATXSELECTLIST */
/* Description: Tx select address from list */

/* Bits 1..0 : Select address from list */
#define SIMIF_DMATXSELECTLIST_DMATXSELECTLIST_Pos (0UL) /*!< Position of DMATXSELECTLIST field. */
#define SIMIF_DMATXSELECTLIST_DMATXSELECTLIST_Msk (0x3UL << SIMIF_DMATXSELECTLIST_DMATXSELECTLIST_Pos) /*!< Bit mask of DMATXSELECTLIST field. */


/* Peripheral: SNOW */
/* Description: Snow 3G Security IP */

/* Register: SNOW_TASKS_STARTGATHER */
/* Description: Start input DMA */

/* Bit 0 : Start input DMA */
#define SNOW_TASKS_STARTGATHER_TASKS_STARTGATHER_Pos (0UL) /*!< Position of TASKS_STARTGATHER field. */
#define SNOW_TASKS_STARTGATHER_TASKS_STARTGATHER_Msk (0x1UL << SNOW_TASKS_STARTGATHER_TASKS_STARTGATHER_Pos) /*!< Bit mask of TASKS_STARTGATHER field. */
#define SNOW_TASKS_STARTGATHER_TASKS_STARTGATHER_Trigger (1UL) /*!< Trigger task */

/* Register: SNOW_TASKS_STOPGATHER */
/* Description: Stop  input DMA */

/* Bit 0 : Stop  input DMA */
#define SNOW_TASKS_STOPGATHER_TASKS_STOPGATHER_Pos (0UL) /*!< Position of TASKS_STOPGATHER field. */
#define SNOW_TASKS_STOPGATHER_TASKS_STOPGATHER_Msk (0x1UL << SNOW_TASKS_STOPGATHER_TASKS_STOPGATHER_Pos) /*!< Bit mask of TASKS_STOPGATHER field. */
#define SNOW_TASKS_STOPGATHER_TASKS_STOPGATHER_Trigger (1UL) /*!< Trigger task */

/* Register: SNOW_TASKS_STARTSCATTER */
/* Description: Start output DMA */

/* Bit 0 : Start output DMA */
#define SNOW_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Pos (0UL) /*!< Position of TASKS_STARTSCATTER field. */
#define SNOW_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Msk (0x1UL << SNOW_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Pos) /*!< Bit mask of TASKS_STARTSCATTER field. */
#define SNOW_TASKS_STARTSCATTER_TASKS_STARTSCATTER_Trigger (1UL) /*!< Trigger task */

