adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 0 : Enable */
#define TIMEMARKMUX_ENABLE_ENABLE_TMRF_Pos (0UL) /*!< Position of ENABLE_TMRF field. */
#define TIMEMARKMUX_ENABLE_ENABLE_TMRF_Msk (0x1UL << TIMEMARKMUX_ENABLE_ENABLE_TMRF_Pos) /*!< Bit mask of ENABLE_TMRF field. */
#define TIMEMARKMUX_ENABLE_ENABLE_TMRF_Disable (0UL) /*!< Disable RF timemark output */
#define TIMEMARKMUX_ENABLE_ENABLE_TMRF_Enable (1UL) /*!< Enable RF timemark output */

/* Register: TIMEMARKMUX_TIMEMARK_INPUT_SELECT */
/* Description: Timemark input select register */

/* Bits 15..8 : GNSS timemark input select */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Pos (8UL) /*!< Position of GNSS_TIMEMARK_SELECT field. */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Msk (0xFFUL << TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Pos) /*!< Bit mask of GNSS_TIMEMARK_SELECT field. */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event0 (0x01UL) /*!< Enable events[0] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event1 (0x02UL) /*!< Enable events[1] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event2 (0x04UL) /*!< Enable events[2] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event3 (0x08UL) /*!< Enable events[3] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event4 (0x10UL) /*!< Enable events[4] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event5 (0x20UL) /*!< Enable events[5] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event6 (0x40UL) /*!< Enable events[6] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_GNSS_TIMEMARK_SELECT_Event7 (0x80UL) /*!< Enable events[7] as timemark input */

/* Bits 7..0 : RF timemark input select */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Pos (0UL) /*!< Position of RF_TIMEMARK_SELECT field. */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Msk (0xFFUL << TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Pos) /*!< Bit mask of RF_TIMEMARK_SELECT field. */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event0 (0x01UL) /*!< Enable events[0] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event1 (0x02UL) /*!< Enable events[1] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event2 (0x04UL) /*!< Enable events[2] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event3 (0x08UL) /*!< Enable events[3] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event4 (0x10UL) /*!< Enable events[4] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event5 (0x20UL) /*!< Enable events[5] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event6 (0x40UL) /*!< Enable events[6] as timemark input */
#define TIMEMARKMUX_TIMEMARK_INPUT_SELECT_RF_TIMEMARK_SELECT_Event7 (0x80UL) /*!< Enable events[7] as timemark input */


/* Peripheral: MODEMTIMER */
/* Description: Modem Timer/Counter 0 */

/* Register: MODEMTIMER_TASKS_START */
/* Description: Start Timer */

/* Bit 0 : Start Timer */
#define MODEMTIMER_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define MODEMTIMER_TASKS_START_TASKS_START_Msk (0x1UL << MODEMTIMER_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define MODEMTIMER_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_TASKS_STOP */
/* Description: Stop Timer */

/* Bit 0 : Stop Timer */
#define MODEMTIMER_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define MODEMTIMER_TASKS_STOP_TASKS_STOP_Msk (0x1UL << MODEMTIMER_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define MODEMTIMER_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_TASKS_CLEAR */
/* Description: Clear time */

/* Bit 0 : Clear time */
#define MODEMTIMER_TASKS_CLEAR_TASKS_CLEAR_Pos (0UL) /*!< Position of TASKS_CLEAR field. */
#define MODEMTIMER_TASKS_CLEAR_TASKS_CLEAR_Msk (0x1UL << MODEMTIMER_TASKS_CLEAR_TASKS_CLEAR_Pos) /*!< Bit mask of TASKS_CLEAR field. */
#define MODEMTIMER_TASKS_CLEAR_TASKS_CLEAR_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_TASKS_SHUTDOWN */
/* Description: Shut down timer */

/* Bit 0 : Shut down timer */
#define MODEMTIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos (0UL) /*!< Position of TASKS_SHUTDOWN field. */
#define MODEMTIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk (0x1UL << MODEMTIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos) /*!< Bit mask of TASKS_SHUTDOWN field. */
#define MODEMTIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_TASKS_STANDBY */
/* Description: Timer from shutdown to stopped state */

/* Bit 0 : Timer from shutdown to stopped state */
#define MODEMTIMER_TASKS_STANDBY_TASKS_STANDBY_Pos (0UL) /*!< Position of TASKS_STANDBY field. */
#define MODEMTIMER_TASKS_STANDBY_TASKS_STANDBY_Msk (0x1UL << MODEMTIMER_TASKS_STANDBY_TASKS_STANDBY_Pos) /*!< Bit mask of TASKS_STANDBY field. */
#define MODEMTIMER_TASKS_STANDBY_TASKS_STANDBY_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_TASKS_CAPTURE */
/* Description: Description collection: Capture Timer value to CC[n] register */

/* Bit 0 : Capture Timer value to CC[n] register */
#define MODEMTIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos (0UL) /*!< Position of TASKS_CAPTURE field. */
#define MODEMTIMER_TASKS_CAPTURE_TASKS_CAPTURE_Msk (0x1UL << MODEMTIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos) /*!< Bit mask of TASKS_CAPTURE field. */
#define MODEMTIMER_TASKS_CAPTURE_TASKS_CAPTURE_Trigger (1UL) /*!< Trigger task */

/* Register: MODEMTIMER_EVENTS_COMPARE */
/* Description: Description collection: Compare event on CC[n] match. */

/* Bit 0 : Compare event on CC[n] match. */
#define MODEMTIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos (0UL) /*!< Position of EVENTS_COMPARE field. */
#define MODEMTIMER_EVENTS_COMPARE_EVENTS_COMPARE_Msk (0x1UL << MODEMTIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos) /*!< Bit mask of EVENTS_COMPARE field. */
#define MODEMTIMER_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated (0UL) /*!< Event not generated */
#define MODEMTIMER_EVENTS_COMPARE_EVENTS_COMPARE_Generated (1UL) /*!< Event generated */

/* Register: MODEMTIMER_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 15 : Shortcut between event COMPARE[7] and task STOP */
#define MODEMTIMER_SHORTS_COMPARE7_STOP_Pos (15UL) /*!< Position of COMPARE7_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE7_STOP_Msk (0x1UL << MODEMTIMER_SHORTS_COMPARE7_STOP_Pos) /*!< Bit mask of COMPARE7_STOP field. */
#define MODEMTIMER_SHORTS_COMPARE7_STOP_Disabled (0UL) /*!< Disable shortcut */
#define MODEMTIMER_SHORTS_COMPARE7_STOP_Enabled (1UL) /*!< Enable shortcut */

