adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 7 : Write '1' to disable interrupt for event COMPARE[7] */
#define MODEMTIMER_INTENCLR1_COMPARE7_Pos (7UL) /*!< Position of COMPARE7 field. */
#define MODEMTIMER_INTENCLR1_COMPARE7_Msk (0x1UL << MODEMTIMER_INTENCLR1_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field. */
#define MODEMTIMER_INTENCLR1_COMPARE7_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENCLR1_COMPARE7_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENCLR1_COMPARE7_Clear (1UL) /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event COMPARE[6] */
#define MODEMTIMER_INTENCLR1_COMPARE6_Pos (6UL) /*!< Position of COMPARE6 field. */
#define MODEMTIMER_INTENCLR1_COMPARE6_Msk (0x1UL << MODEMTIMER_INTENCLR1_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field. */
#define MODEMTIMER_INTENCLR1_COMPARE6_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENCLR1_COMPARE6_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENCLR1_COMPARE6_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event COMPARE[5] */
#define MODEMTIMER_INTENCLR1_COMPARE5_Pos (5UL) /*!< Position of COMPARE5 field. */
#define MODEMTIMER_INTENCLR1_COMPARE5_Msk (0x1UL << MODEMTIMER_INTENCLR1_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field. */
#define MODEMTIMER_INTENCLR1_COMPARE5_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENCLR1_COMPARE5_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENCLR1_COMPARE5_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event COMPARE[4] */
#define MODEMTIMER_INTENCLR1_COMPARE4_Pos (4UL) /*!< Position of COMPARE4 field. */
#define MODEMTIMER_INTENCLR1_COMPARE4_Msk (0x1UL << MODEMTIMER_INTENCLR1_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field. */
#define MODEMTIMER_INTENCLR1_COMPARE4_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENCLR1_COMPARE4_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENCLR1_COMPARE4_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event COMPARE[3] */
#define MODEMTIMER_INTENCLR1_COMPARE3_Pos (3UL) /*!< Position of COMPARE3 field. */
#define MODEMTIMER_INTENCLR1_COMPARE3_Msk (0x1UL << MODEMTIMER_INTENCLR1_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field. */
#define MODEMTIMER_INTENCLR1_COMPARE3_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENCLR1_COMPARE3_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENCLR1_COMPARE3_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event COMPARE[2] */
#define MODEMTIMER_INTENCLR1_COMPARE2_Pos (2UL) /*!< Position of COMPARE2 field. */
#define MODEMTIMER_INTENCLR1_COMPARE2_Msk (0x1UL << MODEMTIMER_INTENCLR1_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field. */
#define MODEMTIMER_INTENCLR1_COMPARE2_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENCLR1_COMPARE2_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENCLR1_COMPARE2_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event COMPARE[1] */
#define MODEMTIMER_INTENCLR1_COMPARE1_Pos (1UL) /*!< Position of COMPARE1 field. */
#define MODEMTIMER_INTENCLR1_COMPARE1_Msk (0x1UL << MODEMTIMER_INTENCLR1_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field. */
#define MODEMTIMER_INTENCLR1_COMPARE1_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENCLR1_COMPARE1_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENCLR1_COMPARE1_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event COMPARE[0] */
#define MODEMTIMER_INTENCLR1_COMPARE0_Pos (0UL) /*!< Position of COMPARE0 field. */
#define MODEMTIMER_INTENCLR1_COMPARE0_Msk (0x1UL << MODEMTIMER_INTENCLR1_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field. */
#define MODEMTIMER_INTENCLR1_COMPARE0_Disabled (0UL) /*!< Read: Disabled */
#define MODEMTIMER_INTENCLR1_COMPARE0_Enabled (1UL) /*!< Read: Enabled */
#define MODEMTIMER_INTENCLR1_COMPARE0_Clear (1UL) /*!< Disable */

/* Register: MODEMTIMER_INTPEND1 */
/* Description: Pending interrupts */

/* Bit 7 : Read pending status of interrupt for event COMPARE[7] */
#define MODEMTIMER_INTPEND1_COMPARE7_Pos (7UL) /*!< Position of COMPARE7 field. */
#define MODEMTIMER_INTPEND1_COMPARE7_Msk (0x1UL << MODEMTIMER_INTPEND1_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field. */
#define MODEMTIMER_INTPEND1_COMPARE7_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND1_COMPARE7_Pending (1UL) /*!< Read: Pending */

/* Bit 6 : Read pending status of interrupt for event COMPARE[6] */
#define MODEMTIMER_INTPEND1_COMPARE6_Pos (6UL) /*!< Position of COMPARE6 field. */
#define MODEMTIMER_INTPEND1_COMPARE6_Msk (0x1UL << MODEMTIMER_INTPEND1_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field. */
#define MODEMTIMER_INTPEND1_COMPARE6_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND1_COMPARE6_Pending (1UL) /*!< Read: Pending */

/* Bit 5 : Read pending status of interrupt for event COMPARE[5] */
#define MODEMTIMER_INTPEND1_COMPARE5_Pos (5UL) /*!< Position of COMPARE5 field. */
#define MODEMTIMER_INTPEND1_COMPARE5_Msk (0x1UL << MODEMTIMER_INTPEND1_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field. */
#define MODEMTIMER_INTPEND1_COMPARE5_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND1_COMPARE5_Pending (1UL) /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event COMPARE[4] */
#define MODEMTIMER_INTPEND1_COMPARE4_Pos (4UL) /*!< Position of COMPARE4 field. */
#define MODEMTIMER_INTPEND1_COMPARE4_Msk (0x1UL << MODEMTIMER_INTPEND1_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field. */
#define MODEMTIMER_INTPEND1_COMPARE4_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND1_COMPARE4_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event COMPARE[3] */
#define MODEMTIMER_INTPEND1_COMPARE3_Pos (3UL) /*!< Position of COMPARE3 field. */
#define MODEMTIMER_INTPEND1_COMPARE3_Msk (0x1UL << MODEMTIMER_INTPEND1_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field. */
#define MODEMTIMER_INTPEND1_COMPARE3_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND1_COMPARE3_Pending (1UL) /*!< Read: Pending */

