adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 2 : Read pending status of interrupt for event COMPARE[2] */
#define MODEMTIMER_INTPEND1_COMPARE2_Pos (2UL) /*!< Position of COMPARE2 field. */
#define MODEMTIMER_INTPEND1_COMPARE2_Msk (0x1UL << MODEMTIMER_INTPEND1_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field. */
#define MODEMTIMER_INTPEND1_COMPARE2_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND1_COMPARE2_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event COMPARE[1] */
#define MODEMTIMER_INTPEND1_COMPARE1_Pos (1UL) /*!< Position of COMPARE1 field. */
#define MODEMTIMER_INTPEND1_COMPARE1_Msk (0x1UL << MODEMTIMER_INTPEND1_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field. */
#define MODEMTIMER_INTPEND1_COMPARE1_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND1_COMPARE1_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event COMPARE[0] */
#define MODEMTIMER_INTPEND1_COMPARE0_Pos (0UL) /*!< Position of COMPARE0 field. */
#define MODEMTIMER_INTPEND1_COMPARE0_Msk (0x1UL << MODEMTIMER_INTPEND1_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field. */
#define MODEMTIMER_INTPEND1_COMPARE0_NotPending (0UL) /*!< Read: Not pending */
#define MODEMTIMER_INTPEND1_COMPARE0_Pending (1UL) /*!< Read: Pending */

/* Register: MODEMTIMER_RUNNING */
/* Description: Status of running timer */

/* Bits 1..0 : Current status */
#define MODEMTIMER_RUNNING_STATUS_Pos (0UL) /*!< Position of STATUS field. */
#define MODEMTIMER_RUNNING_STATUS_Msk (0x3UL << MODEMTIMER_RUNNING_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define MODEMTIMER_RUNNING_STATUS_SHUTDOWN (0UL) /*!< Timer is powered off. */
#define MODEMTIMER_RUNNING_STATUS_RUNNING (1UL) /*!< Timer is actively running. */
#define MODEMTIMER_RUNNING_STATUS_STOPPED (2UL) /*!< Timer is stopped. */

/* Register: MODEMTIMER_CCLO0 */
/* Description: Capture/Compare register 0 - Low Word */

/* Bits 31..0 : Capture/Compare value Low Word */
#define MODEMTIMER_CCLO0_CCLO_Pos (0UL) /*!< Position of CCLO field. */
#define MODEMTIMER_CCLO0_CCLO_Msk (0xFFFFFFFFUL << MODEMTIMER_CCLO0_CCLO_Pos) /*!< Bit mask of CCLO field. */

/* Register: MODEMTIMER_CCHI0 */
/* Description: Capture/Compare register 0 - High Word */

/* Bits 31..0 : Capture/Compare value High Word */
#define MODEMTIMER_CCHI0_CCHI_Pos (0UL) /*!< Position of CCHI field. */
#define MODEMTIMER_CCHI0_CCHI_Msk (0xFFFFFFFFUL << MODEMTIMER_CCHI0_CCHI_Pos) /*!< Bit mask of CCHI field. */

/* Register: MODEMTIMER_CCLO1 */
/* Description: Capture/Compare register 1 - Low Word */

/* Bits 31..0 : Capture/Compare value Low Word */
#define MODEMTIMER_CCLO1_CCLO_Pos (0UL) /*!< Position of CCLO field. */
#define MODEMTIMER_CCLO1_CCLO_Msk (0xFFFFFFFFUL << MODEMTIMER_CCLO1_CCLO_Pos) /*!< Bit mask of CCLO field. */

/* Register: MODEMTIMER_CCHI1 */
/* Description: Capture/Compare register 1 - High Word */

/* Bits 31..0 : Capture/Compare value High Word */
#define MODEMTIMER_CCHI1_CCHI_Pos (0UL) /*!< Position of CCHI field. */
#define MODEMTIMER_CCHI1_CCHI_Msk (0xFFFFFFFFUL << MODEMTIMER_CCHI1_CCHI_Pos) /*!< Bit mask of CCHI field. */

/* Register: MODEMTIMER_CCLO2 */
/* Description: Capture/Compare register 2 - Low Word */

/* Bits 31..0 : Capture/Compare value Low Word */
#define MODEMTIMER_CCLO2_CCLO_Pos (0UL) /*!< Position of CCLO field. */
#define MODEMTIMER_CCLO2_CCLO_Msk (0xFFFFFFFFUL << MODEMTIMER_CCLO2_CCLO_Pos) /*!< Bit mask of CCLO field. */

/* Register: MODEMTIMER_CCHI2 */
/* Description: Capture/Compare register 2 - High Word */

/* Bits 31..0 : Capture/Compare value High Word */
#define MODEMTIMER_CCHI2_CCHI_Pos (0UL) /*!< Position of CCHI field. */
#define MODEMTIMER_CCHI2_CCHI_Msk (0xFFFFFFFFUL << MODEMTIMER_CCHI2_CCHI_Pos) /*!< Bit mask of CCHI field. */

/* Register: MODEMTIMER_CCLO3 */
/* Description: Capture/Compare register 3 - Low Word */

/* Bits 31..0 : Capture/Compare value Low Word */
#define MODEMTIMER_CCLO3_CCLO_Pos (0UL) /*!< Position of CCLO field. */
#define MODEMTIMER_CCLO3_CCLO_Msk (0xFFFFFFFFUL << MODEMTIMER_CCLO3_CCLO_Pos) /*!< Bit mask of CCLO field. */

/* Register: MODEMTIMER_CCHI3 */
/* Description: Capture/Compare register 3 - High Word */

/* Bits 31..0 : Capture/Compare value High Word */
#define MODEMTIMER_CCHI3_CCHI_Pos (0UL) /*!< Position of CCHI field. */
#define MODEMTIMER_CCHI3_CCHI_Msk (0xFFFFFFFFUL << MODEMTIMER_CCHI3_CCHI_Pos) /*!< Bit mask of CCHI field. */

/* Register: MODEMTIMER_CCLO4 */
/* Description: Capture/Compare register 4 - Low Word */

/* Bits 31..0 : Capture/Compare value Low Word */
#define MODEMTIMER_CCLO4_CCLO_Pos (0UL) /*!< Position of CCLO field. */
#define MODEMTIMER_CCLO4_CCLO_Msk (0xFFFFFFFFUL << MODEMTIMER_CCLO4_CCLO_Pos) /*!< Bit mask of CCLO field. */

/* Register: MODEMTIMER_CCHI4 */
/* Description: Capture/Compare register 4 - High Word */

/* Bits 31..0 : Capture/Compare value High Word */
#define MODEMTIMER_CCHI4_CCHI_Pos (0UL) /*!< Position of CCHI field. */
#define MODEMTIMER_CCHI4_CCHI_Msk (0xFFFFFFFFUL << MODEMTIMER_CCHI4_CCHI_Pos) /*!< Bit mask of CCHI field. */

/* Register: MODEMTIMER_CCLO5 */
/* Description: Capture/Compare register 5 - Low Word */

/* Bits 31..0 : Capture/Compare value Low Word */
#define MODEMTIMER_CCLO5_CCLO_Pos (0UL) /*!< Position of CCLO field. */
#define MODEMTIMER_CCLO5_CCLO_Msk (0xFFFFFFFFUL << MODEMTIMER_CCLO5_CCLO_Pos) /*!< Bit mask of CCLO field. */

/* Register: MODEMTIMER_CCHI5 */
/* Description: Capture/Compare register 5 - High Word */

/* Bits 31..0 : Capture/Compare value High Word */
#define MODEMTIMER_CCHI5_CCHI_Pos (0UL) /*!< Position of CCHI field. */
#define MODEMTIMER_CCHI5_CCHI_Msk (0xFFFFFFFFUL << MODEMTIMER_CCHI5_CCHI_Pos) /*!< Bit mask of CCHI field. */

/* Register: MODEMTIMER_CCLO6 */
/* Description: Capture/Compare register 6 - Low Word */

/* Bits 31..0 : Capture/Compare value Low Word */
#define MODEMTIMER_CCLO6_CCLO_Pos (0UL) /*!< Position of CCLO field. */
#define MODEMTIMER_CCLO6_CCLO_Msk (0xFFFFFFFFUL << MODEMTIMER_CCLO6_CCLO_Pos) /*!< Bit mask of CCLO field. */

/* Register: MODEMTIMER_CCHI6 */
/* Description: Capture/Compare register 6 - High Word */

