adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 0 : Decrypt */
#define AES_TASKS_AES_DECRYPT_TASKS_AES_DECRYPT_Pos (0UL) /*!< Position of TASKS_AES_DECRYPT field. */
#define AES_TASKS_AES_DECRYPT_TASKS_AES_DECRYPT_Msk (0x1UL << AES_TASKS_AES_DECRYPT_TASKS_AES_DECRYPT_Pos) /*!< Bit mask of TASKS_AES_DECRYPT field. */
#define AES_TASKS_AES_DECRYPT_TASKS_AES_DECRYPT_Trigger (1UL) /*!< Trigger task */

/* Register: AES_TASKS_DRAIN_AES_OUTPUT */
/* Description: Transfer 8 bytes of output from AES core to DMA */

/* Bit 0 : Transfer 8 bytes of output from AES core to DMA */
#define AES_TASKS_DRAIN_AES_OUTPUT_TASKS_DRAIN_AES_OUTPUT_Pos (0UL) /*!< Position of TASKS_DRAIN_AES_OUTPUT field. */
#define AES_TASKS_DRAIN_AES_OUTPUT_TASKS_DRAIN_AES_OUTPUT_Msk (0x1UL << AES_TASKS_DRAIN_AES_OUTPUT_TASKS_DRAIN_AES_OUTPUT_Pos) /*!< Bit mask of TASKS_DRAIN_AES_OUTPUT field. */
#define AES_TASKS_DRAIN_AES_OUTPUT_TASKS_DRAIN_AES_OUTPUT_Trigger (1UL) /*!< Trigger task */

/* Register: AES_TASKS_RESET */
/* Description: Stop all transfers and crypto operations (software reset) */

/* Bit 0 : Stop all transfers and crypto operations (software reset) */
#define AES_TASKS_RESET_TASKS_RESET_Pos (0UL) /*!< Position of TASKS_RESET field. */
#define AES_TASKS_RESET_TASKS_RESET_Msk (0x1UL << AES_TASKS_RESET_TASKS_RESET_Pos) /*!< Bit mask of TASKS_RESET field. */
#define AES_TASKS_RESET_TASKS_RESET_Trigger (1UL) /*!< Trigger task */

/* Register: AES_EVENTS_GATHER_STARTED */
/* Description: Input DMA started */

/* Bit 0 : Input DMA started */
#define AES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos (0UL) /*!< Position of EVENTS_GATHER_STARTED field. */
#define AES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Msk (0x1UL << AES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Pos) /*!< Bit mask of EVENTS_GATHER_STARTED field. */
#define AES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_GATHER_STARTED_EVENTS_GATHER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: AES_EVENTS_GATHER_DONE */
/* Description: Input DMA done */

/* Bit 0 : Input DMA done */
#define AES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos (0UL) /*!< Position of EVENTS_GATHER_DONE field. */
#define AES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Msk (0x1UL << AES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Pos) /*!< Bit mask of EVENTS_GATHER_DONE field. */
#define AES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_GATHER_DONE_EVENTS_GATHER_DONE_Generated (1UL) /*!< Event generated */

/* Register: AES_EVENTS_SCATTER_STARTED */
/* Description: Output DMA started */

/* Bit 0 : Output DMA started */
#define AES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Pos (0UL) /*!< Position of EVENTS_SCATTER_STARTED field. */
#define AES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Msk (0x1UL << AES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Pos) /*!< Bit mask of EVENTS_SCATTER_STARTED field. */
#define AES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_SCATTER_STARTED_EVENTS_SCATTER_STARTED_Generated (1UL) /*!< Event generated */

/* Register: AES_EVENTS_SCATTER_DONE */
/* Description: Output DMA done */

/* Bit 0 : Output DMA done */
#define AES_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Pos (0UL) /*!< Position of EVENTS_SCATTER_DONE field. */
#define AES_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Msk (0x1UL << AES_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Pos) /*!< Bit mask of EVENTS_SCATTER_DONE field. */
#define AES_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_SCATTER_DONE_EVENTS_SCATTER_DONE_Generated (1UL) /*!< Event generated */

/* Register: AES_EVENTS_KEY_READY */
/* Description: Key received (keybytes == 16) */

/* Bit 0 : Key received (keybytes == 16) */
#define AES_EVENTS_KEY_READY_EVENTS_KEY_READY_Pos (0UL) /*!< Position of EVENTS_KEY_READY field. */
#define AES_EVENTS_KEY_READY_EVENTS_KEY_READY_Msk (0x1UL << AES_EVENTS_KEY_READY_EVENTS_KEY_READY_Pos) /*!< Bit mask of EVENTS_KEY_READY field. */
#define AES_EVENTS_KEY_READY_EVENTS_KEY_READY_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_KEY_READY_EVENTS_KEY_READY_Generated (1UL) /*!< Event generated */

/* Register: AES_EVENTS_IV_READY */
/* Description: IV received (ivbytes == 16) */

/* Bit 0 : IV received (ivbytes == 16) */
#define AES_EVENTS_IV_READY_EVENTS_IV_READY_Pos (0UL) /*!< Position of EVENTS_IV_READY field. */
#define AES_EVENTS_IV_READY_EVENTS_IV_READY_Msk (0x1UL << AES_EVENTS_IV_READY_EVENTS_IV_READY_Pos) /*!< Bit mask of EVENTS_IV_READY field. */
#define AES_EVENTS_IV_READY_EVENTS_IV_READY_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_IV_READY_EVENTS_IV_READY_Generated (1UL) /*!< Event generated */

/* Register: AES_EVENTS_AES_INITIALIZED */
/* Description: New keys (and IV) taken into use */

/* Bit 0 : New keys (and IV) taken into use */
#define AES_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Pos (0UL) /*!< Position of EVENTS_AES_INITIALIZED field. */
#define AES_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Msk (0x1UL << AES_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Pos) /*!< Bit mask of EVENTS_AES_INITIALIZED field. */
#define AES_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_AES_INITIALIZED_EVENTS_AES_INITIALIZED_Generated (1UL) /*!< Event generated */

/* Register: AES_EVENTS_AES_INPUT_FULL */
/* Description: 8 bytes of input stored to AES core */

/* Bit 0 : 8 bytes of input stored to AES core */
#define AES_EVENTS_AES_INPUT_FULL_EVENTS_AES_INPUT_FULL_Pos (0UL) /*!< Position of EVENTS_AES_INPUT_FULL field. */
#define AES_EVENTS_AES_INPUT_FULL_EVENTS_AES_INPUT_FULL_Msk (0x1UL << AES_EVENTS_AES_INPUT_FULL_EVENTS_AES_INPUT_FULL_Pos) /*!< Bit mask of EVENTS_AES_INPUT_FULL field. */
#define AES_EVENTS_AES_INPUT_FULL_EVENTS_AES_INPUT_FULL_NotGenerated (0UL) /*!< Event not generated */
#define AES_EVENTS_AES_INPUT_FULL_EVENTS_AES_INPUT_FULL_Generated (1UL) /*!< Event generated */

