adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 0 : Write '1' to enable interrupt for event GATHER_STARTED */
#define AES_INTENSET_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define AES_INTENSET_GATHER_STARTED_Msk (0x1UL << AES_INTENSET_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define AES_INTENSET_GATHER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENSET_GATHER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENSET_GATHER_STARTED_Set (1UL) /*!< Enable */

/* Register: AES_INTENCLR */
/* Description: Disable interrupt */

/* Bit 11 : Write '1' to disable interrupt for event RESETTED */
#define AES_INTENCLR_RESETTED_Pos (11UL) /*!< Position of RESETTED field. */
#define AES_INTENCLR_RESETTED_Msk (0x1UL << AES_INTENCLR_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define AES_INTENCLR_RESETTED_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_RESETTED_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_RESETTED_Clear (1UL) /*!< Disable */

/* Bit 10 : Write '1' to disable interrupt for event MAC_READY */
#define AES_INTENCLR_MAC_READY_Pos (10UL) /*!< Position of MAC_READY field. */
#define AES_INTENCLR_MAC_READY_Msk (0x1UL << AES_INTENCLR_MAC_READY_Pos) /*!< Bit mask of MAC_READY field. */
#define AES_INTENCLR_MAC_READY_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_MAC_READY_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_MAC_READY_Clear (1UL) /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event AES_OUTPUT_EMPTY */
#define AES_INTENCLR_AES_OUTPUT_EMPTY_Pos (9UL) /*!< Position of AES_OUTPUT_EMPTY field. */
#define AES_INTENCLR_AES_OUTPUT_EMPTY_Msk (0x1UL << AES_INTENCLR_AES_OUTPUT_EMPTY_Pos) /*!< Bit mask of AES_OUTPUT_EMPTY field. */
#define AES_INTENCLR_AES_OUTPUT_EMPTY_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_AES_OUTPUT_EMPTY_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_AES_OUTPUT_EMPTY_Clear (1UL) /*!< Disable */

/* Bit 8 : Write '1' to disable interrupt for event AES_DONE */
#define AES_INTENCLR_AES_DONE_Pos (8UL) /*!< Position of AES_DONE field. */
#define AES_INTENCLR_AES_DONE_Msk (0x1UL << AES_INTENCLR_AES_DONE_Pos) /*!< Bit mask of AES_DONE field. */
#define AES_INTENCLR_AES_DONE_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_AES_DONE_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_AES_DONE_Clear (1UL) /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event AES_INPUT_FULL */
#define AES_INTENCLR_AES_INPUT_FULL_Pos (7UL) /*!< Position of AES_INPUT_FULL field. */
#define AES_INTENCLR_AES_INPUT_FULL_Msk (0x1UL << AES_INTENCLR_AES_INPUT_FULL_Pos) /*!< Bit mask of AES_INPUT_FULL field. */
#define AES_INTENCLR_AES_INPUT_FULL_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_AES_INPUT_FULL_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_AES_INPUT_FULL_Clear (1UL) /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event AES_INITIALIZED */
#define AES_INTENCLR_AES_INITIALIZED_Pos (6UL) /*!< Position of AES_INITIALIZED field. */
#define AES_INTENCLR_AES_INITIALIZED_Msk (0x1UL << AES_INTENCLR_AES_INITIALIZED_Pos) /*!< Bit mask of AES_INITIALIZED field. */
#define AES_INTENCLR_AES_INITIALIZED_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_AES_INITIALIZED_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_AES_INITIALIZED_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event IV_READY */
#define AES_INTENCLR_IV_READY_Pos (5UL) /*!< Position of IV_READY field. */
#define AES_INTENCLR_IV_READY_Msk (0x1UL << AES_INTENCLR_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define AES_INTENCLR_IV_READY_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_IV_READY_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_IV_READY_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event KEY_READY */
#define AES_INTENCLR_KEY_READY_Pos (4UL) /*!< Position of KEY_READY field. */
#define AES_INTENCLR_KEY_READY_Msk (0x1UL << AES_INTENCLR_KEY_READY_Pos) /*!< Bit mask of KEY_READY field. */
#define AES_INTENCLR_KEY_READY_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_KEY_READY_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_KEY_READY_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event SCATTER_DONE */
#define AES_INTENCLR_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define AES_INTENCLR_SCATTER_DONE_Msk (0x1UL << AES_INTENCLR_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define AES_INTENCLR_SCATTER_DONE_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_SCATTER_DONE_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_SCATTER_DONE_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event SCATTER_STARTED */
#define AES_INTENCLR_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define AES_INTENCLR_SCATTER_STARTED_Msk (0x1UL << AES_INTENCLR_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define AES_INTENCLR_SCATTER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_SCATTER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_SCATTER_STARTED_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event GATHER_DONE */
#define AES_INTENCLR_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define AES_INTENCLR_GATHER_DONE_Msk (0x1UL << AES_INTENCLR_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define AES_INTENCLR_GATHER_DONE_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_GATHER_DONE_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_GATHER_DONE_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event GATHER_STARTED */
#define AES_INTENCLR_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define AES_INTENCLR_GATHER_STARTED_Msk (0x1UL << AES_INTENCLR_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define AES_INTENCLR_GATHER_STARTED_Disabled (0UL) /*!< Read: Disabled */
#define AES_INTENCLR_GATHER_STARTED_Enabled (1UL) /*!< Read: Enabled */
#define AES_INTENCLR_GATHER_STARTED_Clear (1UL) /*!< Disable */

/* Register: AES_INTPEND */
/* Description: Pending interrupts */

/* Bit 11 : Read pending status of interrupt for event RESETTED */
#define AES_INTPEND_RESETTED_Pos (11UL) /*!< Position of RESETTED field. */
#define AES_INTPEND_RESETTED_Msk (0x1UL << AES_INTPEND_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define AES_INTPEND_RESETTED_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_RESETTED_Pending (1UL) /*!< Read: Pending */

