adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 10 : Read pending status of interrupt for event MAC_READY */
#define AES_INTPEND_MAC_READY_Pos (10UL) /*!< Position of MAC_READY field. */
#define AES_INTPEND_MAC_READY_Msk (0x1UL << AES_INTPEND_MAC_READY_Pos) /*!< Bit mask of MAC_READY field. */
#define AES_INTPEND_MAC_READY_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_MAC_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 9 : Read pending status of interrupt for event AES_OUTPUT_EMPTY */
#define AES_INTPEND_AES_OUTPUT_EMPTY_Pos (9UL) /*!< Position of AES_OUTPUT_EMPTY field. */
#define AES_INTPEND_AES_OUTPUT_EMPTY_Msk (0x1UL << AES_INTPEND_AES_OUTPUT_EMPTY_Pos) /*!< Bit mask of AES_OUTPUT_EMPTY field. */
#define AES_INTPEND_AES_OUTPUT_EMPTY_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_AES_OUTPUT_EMPTY_Pending (1UL) /*!< Read: Pending */

/* Bit 8 : Read pending status of interrupt for event AES_DONE */
#define AES_INTPEND_AES_DONE_Pos (8UL) /*!< Position of AES_DONE field. */
#define AES_INTPEND_AES_DONE_Msk (0x1UL << AES_INTPEND_AES_DONE_Pos) /*!< Bit mask of AES_DONE field. */
#define AES_INTPEND_AES_DONE_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_AES_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 7 : Read pending status of interrupt for event AES_INPUT_FULL */
#define AES_INTPEND_AES_INPUT_FULL_Pos (7UL) /*!< Position of AES_INPUT_FULL field. */
#define AES_INTPEND_AES_INPUT_FULL_Msk (0x1UL << AES_INTPEND_AES_INPUT_FULL_Pos) /*!< Bit mask of AES_INPUT_FULL field. */
#define AES_INTPEND_AES_INPUT_FULL_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_AES_INPUT_FULL_Pending (1UL) /*!< Read: Pending */

/* Bit 6 : Read pending status of interrupt for event AES_INITIALIZED */
#define AES_INTPEND_AES_INITIALIZED_Pos (6UL) /*!< Position of AES_INITIALIZED field. */
#define AES_INTPEND_AES_INITIALIZED_Msk (0x1UL << AES_INTPEND_AES_INITIALIZED_Pos) /*!< Bit mask of AES_INITIALIZED field. */
#define AES_INTPEND_AES_INITIALIZED_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_AES_INITIALIZED_Pending (1UL) /*!< Read: Pending */

/* Bit 5 : Read pending status of interrupt for event IV_READY */
#define AES_INTPEND_IV_READY_Pos (5UL) /*!< Position of IV_READY field. */
#define AES_INTPEND_IV_READY_Msk (0x1UL << AES_INTPEND_IV_READY_Pos) /*!< Bit mask of IV_READY field. */
#define AES_INTPEND_IV_READY_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_IV_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event KEY_READY */
#define AES_INTPEND_KEY_READY_Pos (4UL) /*!< Position of KEY_READY field. */
#define AES_INTPEND_KEY_READY_Msk (0x1UL << AES_INTPEND_KEY_READY_Pos) /*!< Bit mask of KEY_READY field. */
#define AES_INTPEND_KEY_READY_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_KEY_READY_Pending (1UL) /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event SCATTER_DONE */
#define AES_INTPEND_SCATTER_DONE_Pos (3UL) /*!< Position of SCATTER_DONE field. */
#define AES_INTPEND_SCATTER_DONE_Msk (0x1UL << AES_INTPEND_SCATTER_DONE_Pos) /*!< Bit mask of SCATTER_DONE field. */
#define AES_INTPEND_SCATTER_DONE_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_SCATTER_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event SCATTER_STARTED */
#define AES_INTPEND_SCATTER_STARTED_Pos (2UL) /*!< Position of SCATTER_STARTED field. */
#define AES_INTPEND_SCATTER_STARTED_Msk (0x1UL << AES_INTPEND_SCATTER_STARTED_Pos) /*!< Bit mask of SCATTER_STARTED field. */
#define AES_INTPEND_SCATTER_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_SCATTER_STARTED_Pending (1UL) /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event GATHER_DONE */
#define AES_INTPEND_GATHER_DONE_Pos (1UL) /*!< Position of GATHER_DONE field. */
#define AES_INTPEND_GATHER_DONE_Msk (0x1UL << AES_INTPEND_GATHER_DONE_Pos) /*!< Bit mask of GATHER_DONE field. */
#define AES_INTPEND_GATHER_DONE_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_GATHER_DONE_Pending (1UL) /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event GATHER_STARTED */
#define AES_INTPEND_GATHER_STARTED_Pos (0UL) /*!< Position of GATHER_STARTED field. */
#define AES_INTPEND_GATHER_STARTED_Msk (0x1UL << AES_INTPEND_GATHER_STARTED_Pos) /*!< Bit mask of GATHER_STARTED field. */
#define AES_INTPEND_GATHER_STARTED_NotPending (0UL) /*!< Read: Not pending */
#define AES_INTPEND_GATHER_STARTED_Pending (1UL) /*!< Read: Pending */

/* Register: AES_MODE */
/* Description: Operation mode */

/* Bits 1..0 : Selects ECB, CBC, CBC-MAC or CTR mode */
#define AES_MODE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define AES_MODE_MODE_Msk (0x3UL << AES_MODE_MODE_Pos) /*!< Bit mask of MODE field. */
#define AES_MODE_MODE_ECB (0UL) /*!< Electronic Codebook mode */
#define AES_MODE_MODE_CBC (1UL) /*!< Cipher Block Chaining mode */
#define AES_MODE_MODE_CBCMAC (2UL) /*!< Cipher Block Chaining Message Authentication Code mode */
#define AES_MODE_MODE_CTR (3UL) /*!< Counter mode */

/* Register: AES_CTRBITS */
/* Description: Amount of counter bits used in the CTR mode */

/* Bits 6..0 : Amount of counter bits used in the CTR mode */
#define AES_CTRBITS_CTRBITS_Pos (0UL) /*!< Position of CTRBITS field. */
#define AES_CTRBITS_CTRBITS_Msk (0x7FUL << AES_CTRBITS_CTRBITS_Pos) /*!< Bit mask of CTRBITS field. */

/* Register: AES_KEYMODE */
/* Description: Selects which key is utilized in ciphering operations */

/* Bits 1..0 : Keying mode */
#define AES_KEYMODE_KEYMODE_Pos (0UL) /*!< Position of KEYMODE field. */
#define AES_KEYMODE_KEYMODE_Msk (0x3UL << AES_KEYMODE_KEYMODE_Pos) /*!< Bit mask of KEYMODE field. */
#define AES_KEYMODE_KEYMODE_Nonsecure (0UL) /*!< Use a non-secure key received via DMA */
#define AES_KEYMODE_KEYMODE_Secure (1UL) /*!< Use a secure key from the specific secure key register */
#define AES_KEYMODE_KEYMODE_KPRTL (2UL) /*!< Use the K-PRTL key */

/* Register: AES_LENGTH */
/* Description: Length of the CBC-MAC data to be authenticated */

/* Bits 23..0 : Length of the CBC-MAC data to be authenticated */
#define AES_LENGTH_LENGTH_Pos (0UL) /*!< Position of LENGTH field. */
#define AES_LENGTH_LENGTH_Msk (0xFFFFFFUL << AES_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field. */

/* Register: AES_ENABLE */
/* Description: Enable/disable block */

/* Bit 0 : Enable or disable AES module */
#define AES_ENABLE_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define AES_ENABLE_ENABLE_Msk (0x1UL << AES_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define AES_ENABLE_ENABLE_Disabled (0UL) /*!< Disabled */
#define AES_ENABLE_ENABLE_Enabled (1UL) /*!< Enabled */

/* Register: AES_INJOBPTR */
/* Description: Pointer to the memory address containing the input job list */

/* Bits 31..0 : Input job pointer */
#define AES_INJOBPTR_INJOBPTR_Pos (0UL) /*!< Position of INJOBPTR field. */
#define AES_INJOBPTR_INJOBPTR_Msk (0xFFFFFFFFUL << AES_INJOBPTR_INJOBPTR_Pos) /*!< Bit mask of INJOBPTR field. */

/* Register: AES_OUTJOBPTR */
/* Description: Pointer to the memory address containing the output job list */

/* Bits 31..0 : Output job pointer */
#define AES_OUTJOBPTR_OUTJOBPTR_Pos (0UL) /*!< Position of OUTJOBPTR field. */
#define AES_OUTJOBPTR_OUTJOBPTR_Msk (0xFFFFFFFFUL << AES_OUTJOBPTR_OUTJOBPTR_Pos) /*!< Bit mask of OUTJOBPTR field. */


/* Peripheral: TRACEANDDEBUG */
/* Description: Trace And Debug */

/* Register: TRACEANDDEBUG_STARTCLOCKS */
/* Description: Start all Trace and Debug clocks. */

