adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 0 :   */
#define TRACEANDDEBUG_STARTCLOCKS_STARTCLOCKS_Pos (0UL) /*!< Position of STARTCLOCKS field. */
#define TRACEANDDEBUG_STARTCLOCKS_STARTCLOCKS_Msk (0x1UL << TRACEANDDEBUG_STARTCLOCKS_STARTCLOCKS_Pos) /*!< Bit mask of STARTCLOCKS field. */
#define TRACEANDDEBUG_STARTCLOCKS_STARTCLOCKS_STARTCLOCKS (1UL) /*!< Start all Trace and Debug clocks. */

/* Register: TRACEANDDEBUG_STOPCLOCKS */
/* Description: Stop all Trace and Debug clocks. */

/* Bit 0 :   */
#define TRACEANDDEBUG_STOPCLOCKS_STOPCLOCKS_Pos (0UL) /*!< Position of STOPCLOCKS field. */
#define TRACEANDDEBUG_STOPCLOCKS_STOPCLOCKS_Msk (0x1UL << TRACEANDDEBUG_STOPCLOCKS_STOPCLOCKS_Pos) /*!< Bit mask of STOPCLOCKS field. */
#define TRACEANDDEBUG_STOPCLOCKS_STOPCLOCKS_STOPCLOCKS (1UL) /*!< Stop all Trace and Debug clocks. */

/* Register: TRACEANDDEBUG_ENABLEDEBUG */
/* Description: Master enable for PSEL.TraceData[3:0] and PSEL.TraceClk signals */

/* Bit 0 :   */
#define TRACEANDDEBUG_ENABLEDEBUG_ENABLEDEBUG_Pos (0UL) /*!< Position of ENABLEDEBUG field. */
#define TRACEANDDEBUG_ENABLEDEBUG_ENABLEDEBUG_Msk (0x1UL << TRACEANDDEBUG_ENABLEDEBUG_ENABLEDEBUG_Pos) /*!< Bit mask of ENABLEDEBUG field. */
#define TRACEANDDEBUG_ENABLEDEBUG_ENABLEDEBUG_ENABLEDEBUG (1UL) /*!< Master enable for PSEL.TraceData[3:0] and PSEL.TraceClk signals */

/* Register: TRACEANDDEBUG_PSEL_TRACECLK */
/* Description: Pin number configuration for TraceClk signal */

/* Bit 31 : Connection */
#define TRACEANDDEBUG_PSEL_TRACECLK_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define TRACEANDDEBUG_PSEL_TRACECLK_CONNECT_Msk (0x1UL << TRACEANDDEBUG_PSEL_TRACECLK_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define TRACEANDDEBUG_PSEL_TRACECLK_CONNECT_Connected (0UL) /*!< Connect */
#define TRACEANDDEBUG_PSEL_TRACECLK_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TRACEANDDEBUG_PSEL_TRACECLK_PIN_Pos (0UL) /*!< Position of PIN field. */
#define TRACEANDDEBUG_PSEL_TRACECLK_PIN_Msk (0x1FUL << TRACEANDDEBUG_PSEL_TRACECLK_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: TRACEANDDEBUG_PSEL_TRACEDATA0 */
/* Description: Pin number configuration for TraceData0 signal */

/* Bit 31 : Connection */
#define TRACEANDDEBUG_PSEL_TRACEDATA0_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA0_CONNECT_Msk (0x1UL << TRACEANDDEBUG_PSEL_TRACEDATA0_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA0_CONNECT_Connected (0UL) /*!< Connect */
#define TRACEANDDEBUG_PSEL_TRACEDATA0_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TRACEANDDEBUG_PSEL_TRACEDATA0_PIN_Pos (0UL) /*!< Position of PIN field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA0_PIN_Msk (0x1FUL << TRACEANDDEBUG_PSEL_TRACEDATA0_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: TRACEANDDEBUG_PSEL_TRACEDATA1 */
/* Description: Pin number configuration for TraceData1 signal */

/* Bit 31 : Connection */
#define TRACEANDDEBUG_PSEL_TRACEDATA1_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA1_CONNECT_Msk (0x1UL << TRACEANDDEBUG_PSEL_TRACEDATA1_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA1_CONNECT_Connected (0UL) /*!< Connect */
#define TRACEANDDEBUG_PSEL_TRACEDATA1_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TRACEANDDEBUG_PSEL_TRACEDATA1_PIN_Pos (0UL) /*!< Position of PIN field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA1_PIN_Msk (0x1FUL << TRACEANDDEBUG_PSEL_TRACEDATA1_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: TRACEANDDEBUG_PSEL_TRACEDATA2 */
/* Description: Pin number configuration for TraceData2 signal */

/* Bit 31 : Connection */
#define TRACEANDDEBUG_PSEL_TRACEDATA2_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA2_CONNECT_Msk (0x1UL << TRACEANDDEBUG_PSEL_TRACEDATA2_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA2_CONNECT_Connected (0UL) /*!< Connect */
#define TRACEANDDEBUG_PSEL_TRACEDATA2_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TRACEANDDEBUG_PSEL_TRACEDATA2_PIN_Pos (0UL) /*!< Position of PIN field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA2_PIN_Msk (0x1FUL << TRACEANDDEBUG_PSEL_TRACEDATA2_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: TRACEANDDEBUG_PSEL_TRACEDATA3 */
/* Description: Pin number configuration for TraceData3 signal */

/* Bit 31 : Connection */
#define TRACEANDDEBUG_PSEL_TRACEDATA3_CONNECT_Pos (31UL) /*!< Position of CONNECT field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA3_CONNECT_Msk (0x1UL << TRACEANDDEBUG_PSEL_TRACEDATA3_CONNECT_Pos) /*!< Bit mask of CONNECT field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA3_CONNECT_Connected (0UL) /*!< Connect */
#define TRACEANDDEBUG_PSEL_TRACEDATA3_CONNECT_Disconnected (1UL) /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TRACEANDDEBUG_PSEL_TRACEDATA3_PIN_Pos (0UL) /*!< Position of PIN field. */
#define TRACEANDDEBUG_PSEL_TRACEDATA3_PIN_Msk (0x1FUL << TRACEANDDEBUG_PSEL_TRACEDATA3_PIN_Pos) /*!< Bit mask of PIN field. */

/* Register: TRACEANDDEBUG_TRACEPORTSPEED */
/* Description: Trace port speed selection */

/* Bits 1..0 : Speed of Trace Port clock. Note that the TRACECLK pin will output this clock divided by two. */
#define TRACEANDDEBUG_TRACEPORTSPEED_TRACEPORTSPEED_Pos (0UL) /*!< Position of TRACEPORTSPEED field. */
#define TRACEANDDEBUG_TRACEPORTSPEED_TRACEPORTSPEED_Msk (0x3UL << TRACEANDDEBUG_TRACEPORTSPEED_TRACEPORTSPEED_Pos) /*!< Bit mask of TRACEPORTSPEED field. */
#define TRACEANDDEBUG_TRACEPORTSPEED_TRACEPORTSPEED_32MHz (0UL) /*!< 32 MHz Trace Port clock (TRACECLK = 16 MHz) */
#define TRACEANDDEBUG_TRACEPORTSPEED_TRACEPORTSPEED_16MHz (1UL) /*!< 16 MHz Trace Port clock (TRACECLK = 8 MHz) */
#define TRACEANDDEBUG_TRACEPORTSPEED_TRACEPORTSPEED_8MHz (2UL) /*!< 8 MHz Trace Port clock (TRACECLK = 4 MHz) */
#define TRACEANDDEBUG_TRACEPORTSPEED_TRACEPORTSPEED_4MHz (3UL) /*!< 4 MHz Trace Port clock (TRACECLK = 2 MHz) */

/* Register: TRACEANDDEBUG_SWOSEL */
/* Description: Connect the SWO to the TPIU TRACEDATA[0] */

