adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bits 31..0 : Data pointer */
#define UARTE_RXD_PTR_PTR_Pos (0UL) /*!< Position of PTR field. */
#define UARTE_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << UARTE_RXD_PTR_PTR_Pos) /*!< Bit mask of PTR field. */

/* Register: UARTE_RXD_MAXCNT */
/* Description: Maximum number of bytes in receive buffer */

/* Bits 7..0 : Maximum number of bytes in receive buffer */
#define UARTE_RXD_MAXCNT_MAXCNT_Pos (0UL) /*!< Position of MAXCNT field. */
#define UARTE_RXD_MAXCNT_MAXCNT_Msk (0xFFUL << UARTE_RXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field. */

/* Register: UARTE_RXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 7..0 : Number of bytes transferred in the last transaction */
#define UARTE_RXD_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define UARTE_RXD_AMOUNT_AMOUNT_Msk (0xFFUL << UARTE_RXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

/* Register: UARTE_TXD_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define UARTE_TXD_PTR_PTR_Pos (0UL) /*!< Position of PTR field. */
#define UARTE_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << UARTE_TXD_PTR_PTR_Pos) /*!< Bit mask of PTR field. */

/* Register: UARTE_TXD_MAXCNT */
/* Description: Maximum number of bytes in transmit buffer */

/* Bits 7..0 : Maximum number of bytes in transmit buffer */
#define UARTE_TXD_MAXCNT_MAXCNT_Pos (0UL) /*!< Position of MAXCNT field. */
#define UARTE_TXD_MAXCNT_MAXCNT_Msk (0xFFUL << UARTE_TXD_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field. */

/* Register: UARTE_TXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 7..0 : Number of bytes transferred in the last transaction */
#define UARTE_TXD_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define UARTE_TXD_AMOUNT_AMOUNT_Msk (0xFFUL << UARTE_TXD_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

/* Register: UARTE_CONFIG */
/* Description: Configuration of parity and hardware flow control */

/* Bits 3..1 : Parity */
#define UARTE_CONFIG_PARITY_Pos (1UL) /*!< Position of PARITY field. */
#define UARTE_CONFIG_PARITY_Msk (0x7UL << UARTE_CONFIG_PARITY_Pos) /*!< Bit mask of PARITY field. */
#define UARTE_CONFIG_PARITY_Excluded (0x0UL) /*!< Exclude parity bit */
#define UARTE_CONFIG_PARITY_Included (0x7UL) /*!< Include parity bit */

/* Bit 0 : Hardware flow control */
#define UARTE_CONFIG_HWFC_Pos (0UL) /*!< Position of HWFC field. */
#define UARTE_CONFIG_HWFC_Msk (0x1UL << UARTE_CONFIG_HWFC_Pos) /*!< Bit mask of HWFC field. */
#define UARTE_CONFIG_HWFC_Disabled (0UL) /*!< Disabled */
#define UARTE_CONFIG_HWFC_Enabled (1UL) /*!< Enabled */

/* Register: UARTE_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define UARTE_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define UARTE_POWER_POWER_Msk (0x1UL << UARTE_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define UARTE_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define UARTE_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: UICR */
/* Description: User Information Configuration Registers */

/* Register: UICR_APPROTECT */
/* Description: Access Port protection */

/* Bits 31..0 : Enable or disable Access Port protection */
#define UICR_APPROTECT_APPROTECT_Pos (0UL) /*!< Position of APPROTECT field. */
#define UICR_APPROTECT_APPROTECT_Msk (0xFFFFFFFFUL << UICR_APPROTECT_APPROTECT_Pos) /*!< Bit mask of APPROTECT field. */
#define UICR_APPROTECT_APPROTECT_Enabled (0x00000000UL) /*!< Any value diferent to 0xFFFFFFFF will make debugger access
		              blocking enabled */
#define UICR_APPROTECT_APPROTECT_Disabled (0xFFFFFFFFUL) /*!< Debugger access blocking disabled */

/* Register: UICR_ERASEPROTECT */
/* Description: Flash erase protection */

/* Bits 31..0 : Protect against erase all and erase UICR */
#define UICR_ERASEPROTECT_ERASEPROTECT_Pos (0UL) /*!< Position of ERASEPROTECT field. */
#define UICR_ERASEPROTECT_ERASEPROTECT_Msk (0xFFFFFFFFUL << UICR_ERASEPROTECT_ERASEPROTECT_Pos) /*!< Bit mask of ERASEPROTECT field. */
#define UICR_ERASEPROTECT_ERASEPROTECT_Enabled (0x00000000UL) /*!< Any value diferent to 0xFFFFFFFF will make flash protected
		              against erase all and erase UICR */
#define UICR_ERASEPROTECT_ERASEPROTECT_Disabled (0xFFFFFFFFUL) /*!< Flash not protected against erase all and erase UICR */

/* Register: UICR_ACLREGION0ADDR */
/* Description: ACL region0 address. Value will get inverted in the readout process before writing the value to ACL. */

/* Bits 31..0 : ACL region0 address */
#define UICR_ACLREGION0ADDR_ADDR_Pos (0UL) /*!< Position of ADDR field. */
#define UICR_ACLREGION0ADDR_ADDR_Msk (0xFFFFFFFFUL << UICR_ACLREGION0ADDR_ADDR_Pos) /*!< Bit mask of ADDR field. */

/* Register: UICR_ACLREGION0SIZE */
/* Description: ACL region0 size. Value will get inverted in the readout process before writing the value to ACL. */

/* Bits 31..0 : ACL region0 size */
#define UICR_ACLREGION0SIZE_SIZE_Pos (0UL) /*!< Position of SIZE field. */
#define UICR_ACLREGION0SIZE_SIZE_Msk (0xFFFFFFFFUL << UICR_ACLREGION0SIZE_SIZE_Pos) /*!< Bit mask of SIZE field. */

/* Register: UICR_ACLREGION0PERM */
/* Description: ACL region0 permissions. Value will get inverted in the readout process before writing the value to ACL. */

/* Bits 2..0 : ACL region0 permissions */
#define UICR_ACLREGION0PERM_PERM_Pos (0UL) /*!< Position of PERM field. */
#define UICR_ACLREGION0PERM_PERM_Msk (0x7UL << UICR_ACLREGION0PERM_PERM_Pos) /*!< Bit mask of PERM field. */

/* Register: UICR_ACLREGION1ADDR */
/* Description: ACL region1 address. Value will get inverted in the readout process before writing the value to ACL. */

/* Bits 31..0 : ACL region1 address */
#define UICR_ACLREGION1ADDR_ADDR_Pos (0UL) /*!< Position of ADDR field. */
#define UICR_ACLREGION1ADDR_ADDR_Msk (0xFFFFFFFFUL << UICR_ACLREGION1ADDR_ADDR_Pos) /*!< Bit mask of ADDR field. */

/* Register: UICR_ACLREGION1SIZE */
/* Description: ACL region1 size. Value will get inverted in the readout process before writing the value to ACL. */

