adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bits 31..0 : ACL region1 size */
#define UICR_ACLREGION1SIZE_SIZE_Pos (0UL) /*!< Position of SIZE field. */
#define UICR_ACLREGION1SIZE_SIZE_Msk (0xFFFFFFFFUL << UICR_ACLREGION1SIZE_SIZE_Pos) /*!< Bit mask of SIZE field. */

/* Register: UICR_ACLREGION1PERM */
/* Description: ACL region1 permissions. Value will get inverted in the readout process before writing the value to ACL. */

/* Bits 2..0 : ACL region1 permissions */
#define UICR_ACLREGION1PERM_PERM_Pos (0UL) /*!< Position of PERM field. */
#define UICR_ACLREGION1PERM_PERM_Msk (0x7UL << UICR_ACLREGION1PERM_PERM_Pos) /*!< Bit mask of PERM field. */

/* Register: UICR_MDMNVMCPOFGUARD */
/* Description: Enable blocking NVM WRITE and aborting NVM ERASE for LTE-Modem NVM in POFWARN condition. */

/* Bit 0 : Enable blocking NVM WRITE and aborting NVM ERASE in POFWARN condition. */
#define UICR_MDMNVMCPOFGUARD_NVMCPOFGUARDEN_Pos (0UL) /*!< Position of NVMCPOFGUARDEN field. */
#define UICR_MDMNVMCPOFGUARD_NVMCPOFGUARDEN_Msk (0x1UL << UICR_MDMNVMCPOFGUARD_NVMCPOFGUARDEN_Pos) /*!< Bit mask of NVMCPOFGUARDEN field. */
#define UICR_MDMNVMCPOFGUARD_NVMCPOFGUARDEN_Disabled (0UL) /*!< NVM WRITE and NVM ERASE are not blocked in POFWARN condition. */
#define UICR_MDMNVMCPOFGUARD_NVMCPOFGUARDEN_Enabled (1UL) /*!< NVM WRITE and NVM ERASE are blocked in POFWARN condition. */

/* Register: UICR_PKEYREVOKED */
/* Description: Private key revoked status. */

/* Bit 0 : Private key revoked status. */
#define UICR_PKEYREVOKED_REVOKED_Pos (0UL) /*!< Position of REVOKED field. */
#define UICR_PKEYREVOKED_REVOKED_Msk (0x1UL << UICR_PKEYREVOKED_REVOKED_Pos) /*!< Bit mask of REVOKED field. */
#define UICR_PKEYREVOKED_REVOKED_Revoked (0UL) /*!< Private key revoked and not usable anymore. */
#define UICR_PKEYREVOKED_REVOKED_Valid (1UL) /*!< Private key valid and usable. */

/* Register: UICR_UARTBLOCK */
/* Description: Modem UART RXD TXD blocking. */

/* Bit 1 : TXD output blocking setting */
#define UICR_UARTBLOCK_TXDBLOCKING_Pos (1UL) /*!< Position of TXDBLOCKING field. */
#define UICR_UARTBLOCK_TXDBLOCKING_Msk (0x1UL << UICR_UARTBLOCK_TXDBLOCKING_Pos) /*!< Bit mask of TXDBLOCKING field. */
#define UICR_UARTBLOCK_TXDBLOCKING_Blocked (0UL) /*!< TXD blocked, tied low. */
#define UICR_UARTBLOCK_TXDBLOCKING_NotBlocked (1UL) /*!< TXD not blocked. */

/* Bit 0 : RXD input blocking setting */
#define UICR_UARTBLOCK_RXDBLOCKING_Pos (0UL) /*!< Position of RXDBLOCKING field. */
#define UICR_UARTBLOCK_RXDBLOCKING_Msk (0x1UL << UICR_UARTBLOCK_RXDBLOCKING_Pos) /*!< Bit mask of RXDBLOCKING field. */
#define UICR_UARTBLOCK_RXDBLOCKING_Blocked (0UL) /*!< RXD blocked, tied low. */
#define UICR_UARTBLOCK_RXDBLOCKING_NotBlocked (1UL) /*!< RXD not blocked. */

/* Register: UICR_KEYSLOT1DEST */
/* Description: KEYSLOT1 destination address */

/* Bits 31..0 : KEYSLOT1 destination address */
#define UICR_KEYSLOT1DEST_DEST_Pos (0UL) /*!< Position of DEST field. */
#define UICR_KEYSLOT1DEST_DEST_Msk (0xFFFFFFFFUL << UICR_KEYSLOT1DEST_DEST_Pos) /*!< Bit mask of DEST field. */

/* Register: UICR_KEYSLOT1CONFIG */
/* Description: KEYSLOT1 configuration */

/* Bit 16 : Key status */
#define UICR_KEYSLOT1CONFIG_STATUS_Pos (16UL) /*!< Position of STATUS field. */
#define UICR_KEYSLOT1CONFIG_STATUS_Msk (0x1UL << UICR_KEYSLOT1CONFIG_STATUS_Pos) /*!< Bit mask of STATUS field. */
#define UICR_KEYSLOT1CONFIG_STATUS_Revoked (0UL) /*!< Key revoked */
#define UICR_KEYSLOT1CONFIG_STATUS_Active (1UL) /*!< Key active */

/* Bit 2 : Push permission for key slot {i} */
#define UICR_KEYSLOT1CONFIG_PUSH_Pos (2UL) /*!< Position of PUSH field. */
#define UICR_KEYSLOT1CONFIG_PUSH_Msk (0x1UL << UICR_KEYSLOT1CONFIG_PUSH_Pos) /*!< Bit mask of PUSH field. */
#define UICR_KEYSLOT1CONFIG_PUSH_Disabled (0UL) /*!< Content of registers KEYSLOT{i}.VALUE[0-3] can not be pushed, but can be read if field READ is 'Enabled' */
#define UICR_KEYSLOT1CONFIG_PUSH_Enabled (1UL) /*!< Content of registers KEYSLOT{i}.VALUE[0-3] can be pushed over secure APB. Register KEYSLOT{i}.DEST must contain a valid destination address! */

/* Bit 1 : Read permission for key slot {i}. */
#define UICR_KEYSLOT1CONFIG_READ_Pos (1UL) /*!< Position of READ field. */
#define UICR_KEYSLOT1CONFIG_READ_Msk (0x1UL << UICR_KEYSLOT1CONFIG_READ_Pos) /*!< Bit mask of READ field. */
#define UICR_KEYSLOT1CONFIG_READ_Disabled (0UL) /*!< Disable read from registers KEYSLOT{i}.VALUE[0-3] */
#define UICR_KEYSLOT1CONFIG_READ_Enabled (1UL) /*!< Registers KEYSLOT{i}.VALUE[0-3] can be read */

/* Bit 0 : Write permission for key slot {i} */
#define UICR_KEYSLOT1CONFIG_WRITE_Pos (0UL) /*!< Position of WRITE field. */
#define UICR_KEYSLOT1CONFIG_WRITE_Msk (0x1UL << UICR_KEYSLOT1CONFIG_WRITE_Pos) /*!< Bit mask of WRITE field. */
#define UICR_KEYSLOT1CONFIG_WRITE_Disabled (0UL) /*!< Disable write to registers KEYSLOT{i}.VALUE[0-3] */
#define UICR_KEYSLOT1CONFIG_WRITE_Enabled (1UL) /*!< Registers KEYSLOT{i}.VALUE[0-3] can be written */

/* Register: UICR_KEYSLOT1KEYVALUE0 */
/* Description: KEYSLOT1 key bits [31:0] */

/* Bits 31..0 : KEYSLOT1 key bits [31:0] */
#define UICR_KEYSLOT1KEYVALUE0_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define UICR_KEYSLOT1KEYVALUE0_VALUE_Msk (0xFFFFFFFFUL << UICR_KEYSLOT1KEYVALUE0_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: UICR_KEYSLOT1KEYVALUE1 */
/* Description: KEYSLOT1 key bits [63:32] */

/* Bits 31..0 : KEYSLOT1 key bits [63:32] */
#define UICR_KEYSLOT1KEYVALUE1_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define UICR_KEYSLOT1KEYVALUE1_VALUE_Msk (0xFFFFFFFFUL << UICR_KEYSLOT1KEYVALUE1_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: UICR_KEYSLOT1KEYVALUE2 */
/* Description: KEYSLOT1 key bits [95:64] */

/* Bits 31..0 : KEYSLOT1 key bits [95:64] */
#define UICR_KEYSLOT1KEYVALUE2_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define UICR_KEYSLOT1KEYVALUE2_VALUE_Msk (0xFFFFFFFFUL << UICR_KEYSLOT1KEYVALUE2_VALUE_Pos) /*!< Bit mask of VALUE field. */

/* Register: UICR_KEYSLOT1KEYVALUE3 */
/* Description: KEYSLOT1 key bits [127:96] */

/* Bits 31..0 : KEYSLOT1 key bits [127:96] */
#define UICR_KEYSLOT1KEYVALUE3_VALUE_Pos (0UL) /*!< Position of VALUE field. */
#define UICR_KEYSLOT1KEYVALUE3_VALUE_Msk (0xFFFFFFFFUL << UICR_KEYSLOT1KEYVALUE3_VALUE_Pos) /*!< Bit mask of VALUE field. */


/* Peripheral: VMC */
/* Description: Volatile Memory controller */

/* Register: VMC_RAM_POWER */
/* Description: Description cluster: RAMn power control register */

/* Bit 17 : Unused retention control bit */
#define VMC_RAM_POWER_UNUSED_RETENTION1_Pos (17UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAM_POWER_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAM_POWER_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 16 : Unused retention control bit */
#define VMC_RAM_POWER_S01RETENTION_Pos (16UL) /*!< Position of S01RETENTION field. */
#define VMC_RAM_POWER_S01RETENTION_Msk (0x1UL << VMC_RAM_POWER_S01RETENTION_Pos) /*!< Bit mask of S01RETENTION field. */

/* Bit 1 : Unused power control bit */
#define VMC_RAM_POWER_UNUSED_POWER1_Pos (1UL) /*!< Position of UNUSED_POWER1 field. */
#define VMC_RAM_POWER_UNUSED_POWER1_Msk (0x1UL << VMC_RAM_POWER_UNUSED_POWER1_Pos) /*!< Bit mask of UNUSED_POWER1 field. */

/* Bit 0 : Unused power control bit */
#define VMC_RAM_POWER_S01POWER_Pos (0UL) /*!< Position of S01POWER field. */
#define VMC_RAM_POWER_S01POWER_Msk (0x1UL << VMC_RAM_POWER_S01POWER_Pos) /*!< Bit mask of S01POWER field. */

