adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Bit 28 : Unused retention set bit 11 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION11_Pos (28UL) /*!< Position of UNUSED_RETENTION11 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION11_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION11_Pos) /*!< Bit mask of UNUSED_RETENTION11 field. */

/* Bit 27 : Unused retention set bit 10 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION10_Pos (27UL) /*!< Position of UNUSED_RETENTION10 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION10_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION10_Pos) /*!< Bit mask of UNUSED_RETENTION10 field. */

/* Bit 26 : Unused retention set bit 9 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION9_Pos (26UL) /*!< Position of UNUSED_RETENTION9 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION9_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION9_Pos) /*!< Bit mask of UNUSED_RETENTION9 field. */

/* Bit 25 : Unused retention set bit 8 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION8_Pos (25UL) /*!< Position of UNUSED_RETENTION8 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION8_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION8_Pos) /*!< Bit mask of UNUSED_RETENTION8 field. */

/* Bit 24 : Unused retention set bit 7 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION7_Pos (24UL) /*!< Position of UNUSED_RETENTION7 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION7_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION7_Pos) /*!< Bit mask of UNUSED_RETENTION7 field. */

/* Bit 23 : Unused retention set bit 6 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION6_Pos (23UL) /*!< Position of UNUSED_RETENTION6 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION6_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION6_Pos) /*!< Bit mask of UNUSED_RETENTION6 field. */

/* Bit 22 : Unused retention set bit 5 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION5_Pos (22UL) /*!< Position of UNUSED_RETENTION5 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION5_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION5_Pos) /*!< Bit mask of UNUSED_RETENTION5 field. */

/* Bit 21 : Unused retention set bit 4 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION4_Pos (21UL) /*!< Position of UNUSED_RETENTION4 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION4_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION4_Pos) /*!< Bit mask of UNUSED_RETENTION4 field. */

/* Bit 20 : Unused retention set bit 3 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION3_Pos (20UL) /*!< Position of UNUSED_RETENTION3 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION3_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION3_Pos) /*!< Bit mask of UNUSED_RETENTION3 field. */

/* Bit 19 : Unused retention set bit 2 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION2_Pos (19UL) /*!< Position of UNUSED_RETENTION2 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION2_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION2_Pos) /*!< Bit mask of UNUSED_RETENTION2 field. */

/* Bit 18 : Unused retention set bit 1 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION1_Pos (18UL) /*!< Position of UNUSED_RETENTION1 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION1_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION1_Pos) /*!< Bit mask of UNUSED_RETENTION1 field. */

/* Bit 17 : Unused retention set bit 0 */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION0_Pos (17UL) /*!< Position of UNUSED_RETENTION0 field. */
#define VMC_RAMB_POWERSET_UNUSED_RETENTION0_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_RETENTION0_Pos) /*!< Bit mask of UNUSED_RETENTION0 field. */

/* Bit 16 : Keep retention on RAM section S0-S15 of RAM Bn when RAM section is switched off */
#define VMC_RAMB_POWERSET_S015RETENTION_Pos (16UL) /*!< Position of S015RETENTION field. */
#define VMC_RAMB_POWERSET_S015RETENTION_Msk (0x1UL << VMC_RAMB_POWERSET_S015RETENTION_Pos) /*!< Bit mask of S015RETENTION field. */
#define VMC_RAMB_POWERSET_S015RETENTION_On (1UL) /*!< On */

/* Bit 15 : Unused power set bit 14 */
#define VMC_RAMB_POWERSET_UNUSED_POWER14_Pos (15UL) /*!< Position of UNUSED_POWER14 field. */
#define VMC_RAMB_POWERSET_UNUSED_POWER14_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_POWER14_Pos) /*!< Bit mask of UNUSED_POWER14 field. */

/* Bit 14 : Unused power set bit 13 */
#define VMC_RAMB_POWERSET_UNUSED_POWER13_Pos (14UL) /*!< Position of UNUSED_POWER13 field. */
#define VMC_RAMB_POWERSET_UNUSED_POWER13_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_POWER13_Pos) /*!< Bit mask of UNUSED_POWER13 field. */

/* Bit 13 : Unused power set bit 12 */
#define VMC_RAMB_POWERSET_UNUSED_POWER12_Pos (13UL) /*!< Position of UNUSED_POWER12 field. */
#define VMC_RAMB_POWERSET_UNUSED_POWER12_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_POWER12_Pos) /*!< Bit mask of UNUSED_POWER12 field. */

/* Bit 12 : Unused power set bit 11 */
#define VMC_RAMB_POWERSET_UNUSED_POWER11_Pos (12UL) /*!< Position of UNUSED_POWER11 field. */
#define VMC_RAMB_POWERSET_UNUSED_POWER11_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_POWER11_Pos) /*!< Bit mask of UNUSED_POWER11 field. */

/* Bit 11 : Unused power set bit 10 */
#define VMC_RAMB_POWERSET_UNUSED_POWER10_Pos (11UL) /*!< Position of UNUSED_POWER10 field. */
#define VMC_RAMB_POWERSET_UNUSED_POWER10_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_POWER10_Pos) /*!< Bit mask of UNUSED_POWER10 field. */

/* Bit 10 : Unused power set bit 9 */
#define VMC_RAMB_POWERSET_UNUSED_POWER9_Pos (10UL) /*!< Position of UNUSED_POWER9 field. */
#define VMC_RAMB_POWERSET_UNUSED_POWER9_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_POWER9_Pos) /*!< Bit mask of UNUSED_POWER9 field. */

/* Bit 9 : Unused power set bit 8 */
#define VMC_RAMB_POWERSET_UNUSED_POWER8_Pos (9UL) /*!< Position of UNUSED_POWER8 field. */
#define VMC_RAMB_POWERSET_UNUSED_POWER8_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_POWER8_Pos) /*!< Bit mask of UNUSED_POWER8 field. */

/* Bit 8 : Unused power set bit 7 */
#define VMC_RAMB_POWERSET_UNUSED_POWER7_Pos (8UL) /*!< Position of UNUSED_POWER7 field. */
#define VMC_RAMB_POWERSET_UNUSED_POWER7_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_POWER7_Pos) /*!< Bit mask of UNUSED_POWER7 field. */

/* Bit 7 : Unused power set bit 6 */
#define VMC_RAMB_POWERSET_UNUSED_POWER6_Pos (7UL) /*!< Position of UNUSED_POWER6 field. */
#define VMC_RAMB_POWERSET_UNUSED_POWER6_Msk (0x1UL << VMC_RAMB_POWERSET_UNUSED_POWER6_Pos) /*!< Bit mask of UNUSED_POWER6 field. */

