adamkondraciuk/nrfx/mdk/nrf9120_modem_bitfields.h
/* Register: ZUC_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 8 : Enable or disable interrupt for event RESETTED */
#define ZUC_INTEN_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define ZUC_INTEN_RESETTED_Msk (0x1UL << ZUC_INTEN_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define ZUC_INTEN_RESETTED_Disabled (0UL) /*!< Disable */
#define ZUC_INTEN_RESETTED_Enabled (1UL) /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event MACREADY */
#define ZUC_INTEN_MACREADY_Pos (7UL) /*!< Position of MACREADY field. */
#define ZUC_INTEN_MACREADY_Msk (0x1UL << ZUC_INTEN_MACREADY_Pos) /*!< Bit mask of MACREADY field. */
#define ZUC_INTEN_MACREADY_Disabled (0UL) /*!< Disable */
#define ZUC_INTEN_MACREADY_Enabled (1UL) /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event MESSAGEREADY */
#define ZUC_INTEN_MESSAGEREADY_Pos (6UL) /*!< Position of MESSAGEREADY field. */
#define ZUC_INTEN_MESSAGEREADY_Msk (0x1UL << ZUC_INTEN_MESSAGEREADY_Pos) /*!< Bit mask of MESSAGEREADY field. */
#define ZUC_INTEN_MESSAGEREADY_Disabled (0UL) /*!< Disable */
#define ZUC_INTEN_MESSAGEREADY_Enabled (1UL) /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event ZUCINITIALIZED */
#define ZUC_INTEN_ZUCINITIALIZED_Pos (5UL) /*!< Position of ZUCINITIALIZED field. */
#define ZUC_INTEN_ZUCINITIALIZED_Msk (0x1UL << ZUC_INTEN_ZUCINITIALIZED_Pos) /*!< Bit mask of ZUCINITIALIZED field. */
#define ZUC_INTEN_ZUCINITIALIZED_Disabled (0UL) /*!< Disable */
#define ZUC_INTEN_ZUCINITIALIZED_Enabled (1UL) /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event IVREADY */
#define ZUC_INTEN_IVREADY_Pos (4UL) /*!< Position of IVREADY field. */
#define ZUC_INTEN_IVREADY_Msk (0x1UL << ZUC_INTEN_IVREADY_Pos) /*!< Bit mask of IVREADY field. */
#define ZUC_INTEN_IVREADY_Disabled (0UL) /*!< Disable */
#define ZUC_INTEN_IVREADY_Enabled (1UL) /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event SCATTERDONE */
#define ZUC_INTEN_SCATTERDONE_Pos (3UL) /*!< Position of SCATTERDONE field. */
#define ZUC_INTEN_SCATTERDONE_Msk (0x1UL << ZUC_INTEN_SCATTERDONE_Pos) /*!< Bit mask of SCATTERDONE field. */
#define ZUC_INTEN_SCATTERDONE_Disabled (0UL) /*!< Disable */
#define ZUC_INTEN_SCATTERDONE_Enabled (1UL) /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event SCATTERSTARTED */
#define ZUC_INTEN_SCATTERSTARTED_Pos (2UL) /*!< Position of SCATTERSTARTED field. */
#define ZUC_INTEN_SCATTERSTARTED_Msk (0x1UL << ZUC_INTEN_SCATTERSTARTED_Pos) /*!< Bit mask of SCATTERSTARTED field. */
#define ZUC_INTEN_SCATTERSTARTED_Disabled (0UL) /*!< Disable */
#define ZUC_INTEN_SCATTERSTARTED_Enabled (1UL) /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event GATHERDONE */
#define ZUC_INTEN_GATHERDONE_Pos (1UL) /*!< Position of GATHERDONE field. */
#define ZUC_INTEN_GATHERDONE_Msk (0x1UL << ZUC_INTEN_GATHERDONE_Pos) /*!< Bit mask of GATHERDONE field. */
#define ZUC_INTEN_GATHERDONE_Disabled (0UL) /*!< Disable */
#define ZUC_INTEN_GATHERDONE_Enabled (1UL) /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event GATHERSTARTED */
#define ZUC_INTEN_GATHERSTARTED_Pos (0UL) /*!< Position of GATHERSTARTED field. */
#define ZUC_INTEN_GATHERSTARTED_Msk (0x1UL << ZUC_INTEN_GATHERSTARTED_Pos) /*!< Bit mask of GATHERSTARTED field. */
#define ZUC_INTEN_GATHERSTARTED_Disabled (0UL) /*!< Disable */
#define ZUC_INTEN_GATHERSTARTED_Enabled (1UL) /*!< Enable */

/* Register: ZUC_INTENSET */
/* Description: Enable interrupt */

/* Bit 8 : Write '1' to enable interrupt for event RESETTED */
#define ZUC_INTENSET_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define ZUC_INTENSET_RESETTED_Msk (0x1UL << ZUC_INTENSET_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define ZUC_INTENSET_RESETTED_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENSET_RESETTED_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENSET_RESETTED_Set (1UL) /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event MACREADY */
#define ZUC_INTENSET_MACREADY_Pos (7UL) /*!< Position of MACREADY field. */
#define ZUC_INTENSET_MACREADY_Msk (0x1UL << ZUC_INTENSET_MACREADY_Pos) /*!< Bit mask of MACREADY field. */
#define ZUC_INTENSET_MACREADY_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENSET_MACREADY_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENSET_MACREADY_Set (1UL) /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event MESSAGEREADY */
#define ZUC_INTENSET_MESSAGEREADY_Pos (6UL) /*!< Position of MESSAGEREADY field. */
#define ZUC_INTENSET_MESSAGEREADY_Msk (0x1UL << ZUC_INTENSET_MESSAGEREADY_Pos) /*!< Bit mask of MESSAGEREADY field. */
#define ZUC_INTENSET_MESSAGEREADY_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENSET_MESSAGEREADY_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENSET_MESSAGEREADY_Set (1UL) /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event ZUCINITIALIZED */
#define ZUC_INTENSET_ZUCINITIALIZED_Pos (5UL) /*!< Position of ZUCINITIALIZED field. */
#define ZUC_INTENSET_ZUCINITIALIZED_Msk (0x1UL << ZUC_INTENSET_ZUCINITIALIZED_Pos) /*!< Bit mask of ZUCINITIALIZED field. */
#define ZUC_INTENSET_ZUCINITIALIZED_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENSET_ZUCINITIALIZED_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENSET_ZUCINITIALIZED_Set (1UL) /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event IVREADY */
#define ZUC_INTENSET_IVREADY_Pos (4UL) /*!< Position of IVREADY field. */
#define ZUC_INTENSET_IVREADY_Msk (0x1UL << ZUC_INTENSET_IVREADY_Pos) /*!< Bit mask of IVREADY field. */
#define ZUC_INTENSET_IVREADY_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENSET_IVREADY_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENSET_IVREADY_Set (1UL) /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event SCATTERDONE */
#define ZUC_INTENSET_SCATTERDONE_Pos (3UL) /*!< Position of SCATTERDONE field. */
#define ZUC_INTENSET_SCATTERDONE_Msk (0x1UL << ZUC_INTENSET_SCATTERDONE_Pos) /*!< Bit mask of SCATTERDONE field. */
#define ZUC_INTENSET_SCATTERDONE_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENSET_SCATTERDONE_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENSET_SCATTERDONE_Set (1UL) /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event SCATTERSTARTED */
#define ZUC_INTENSET_SCATTERSTARTED_Pos (2UL) /*!< Position of SCATTERSTARTED field. */
#define ZUC_INTENSET_SCATTERSTARTED_Msk (0x1UL << ZUC_INTENSET_SCATTERSTARTED_Pos) /*!< Bit mask of SCATTERSTARTED field. */
#define ZUC_INTENSET_SCATTERSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENSET_SCATTERSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENSET_SCATTERSTARTED_Set (1UL) /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event GATHERDONE */
#define ZUC_INTENSET_GATHERDONE_Pos (1UL) /*!< Position of GATHERDONE field. */
#define ZUC_INTENSET_GATHERDONE_Msk (0x1UL << ZUC_INTENSET_GATHERDONE_Pos) /*!< Bit mask of GATHERDONE field. */
#define ZUC_INTENSET_GATHERDONE_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENSET_GATHERDONE_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENSET_GATHERDONE_Set (1UL) /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event GATHERSTARTED */
#define ZUC_INTENSET_GATHERSTARTED_Pos (0UL) /*!< Position of GATHERSTARTED field. */
#define ZUC_INTENSET_GATHERSTARTED_Msk (0x1UL << ZUC_INTENSET_GATHERSTARTED_Pos) /*!< Bit mask of GATHERSTARTED field. */
#define ZUC_INTENSET_GATHERSTARTED_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENSET_GATHERSTARTED_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENSET_GATHERSTARTED_Set (1UL) /*!< Enable */

/* Register: ZUC_INTENCLR */
/* Description: Disable interrupt */

/* Bit 8 : Write '1' to disable interrupt for event RESETTED */
#define ZUC_INTENCLR_RESETTED_Pos (8UL) /*!< Position of RESETTED field. */
#define ZUC_INTENCLR_RESETTED_Msk (0x1UL << ZUC_INTENCLR_RESETTED_Pos) /*!< Bit mask of RESETTED field. */
#define ZUC_INTENCLR_RESETTED_Disabled (0UL) /*!< Read: Disabled */
#define ZUC_INTENCLR_RESETTED_Enabled (1UL) /*!< Read: Enabled */
#define ZUC_INTENCLR_RESETTED_Clear (1UL) /*!< Disable */

